return
{
-- [color=0xffffffff]
-- [color=0x6090c0ff]
-- •
--------------------------------------------------------------
-- PAGE1
--------------------------------------------------------------
{
{'header1', [[[color=0xffffffff]ИГРОВЫЕ РЕЖИМЫ]]},
{'text', [[DCS: UH-1H Huey имеет два игровых режима: режим полета и режим упрощенной авионики, оба режима превращают этот реалистичный авиасимулятор в игру-боевик в воздухе с простым управлением. Игровые режимы можно выбрать во вкладке ОПЦИИ – ИГРА из основного меню, пользуясь либо маркером выделения, либо кнопками настройки в нижней части меню.
]]},
{'picture', [[image manual page1.png]]}
},
--------------------------------------------------------------
-- PAGE2
--------------------------------------------------------------
{
{'text', [[В режиме полета граздо легче управлять вертолетом. Этот режим рекомендуется для начинающих, а также для игры без джойстика. В режиме упрощенной авионики на экран добавляется несколько информационных индикаторов, упрощается обнаружение цели, а также применение оружия.]]},
{'text', [[
[b]В режиме упрощенной авионики используется отдельный профиль ввода данных. Смотрите профиль ввода данных в ОПЦИИ – УПРАВЛЯЮЩИЕ КЛАВИШИ - “UH-1H Игра” для ознакомления с полным списком входных команд в режиме упрощенной авионики.[/b]
]]},
{'picture', [[image manual page2.png]]}
},
--------------------------------------------------------------
-- PAGE3
--------------------------------------------------------------
{
{'text', [[В режиме упрощенной авионики есть следующие специальные индикаторы:]]},
{'picture', [[image manual page3.png]]}
},
--------------------------------------------------------------
-- PAGE4
--------------------------------------------------------------
{
{'text', [[
[b]ПОЗИЦИЯ НОСОВОЙ ЧАСТИ.[/b] Линия визирования ЛА (направление носовой части).
[b]ПРИЦЕЛЬНАЯ МЕТКА.[/b] Точка прицеливания для выбранного оружия.
[b]РАДАР.[/b] Экран радиолокатора с углом обзора 360 градусов показывает все военизированные части вокруг Вашего ЛА. Вы можете последовательно переключать масштаб экрана между значениями 1, 5, 10, 20 или 50 км. Сине-белый кружок обозначает Ваш аэродром посадки.
[b]ПОДРАЗДЕЛЕНИЯ ПРОТИВНИКА (КРАСНЫЙ).[/b] Подразделения, принадлежащие к коалиции противника.
[b]СВОИ ПОДРАЗДЕЛЕНИЯ (ЗЕЛЕНЫЙ).[/b] Подразделения, принадлежащие к своей коалиции.
[b]ИНДИКАТОР ЖИЗНИ.[/b] Индикатор жизни вертолета показывает степень нанесенных ему повреждений.
[b]ВЫБРАННОЕ ОРУЖИЕ.[/b] Показывает выбранное оружие и количество оставшихся боеприпасов.
В режиме полета можно переключаться на вид из кабины нажатием [color=0x6090c0ff]F1[/color]. Чтобы вернуться к виду от третьего лица, нажмите [color=0x6090c0ff]F4[/color].
]]},
},
--------------------------------------------------------------
-- PAGE5
--------------------------------------------------------------
{
{'picture', [[image manual page5_1.png]]},
{'picture', [[image manual page5_2.png]]}
},
--------------------------------------------------------------
-- PAGE6
--------------------------------------------------------------
{
{'picture', [[image manual page6.png]]}
},
--------------------------------------------------------------
-- PAGE7
--------------------------------------------------------------
{
{'header2', [[Основные клавиши режима упрощенной авионики]]},
{'text', [[
Ниже представлены основные команды, использующиеся при полете на вертолете UH-1H в режиме упрощенной авионики:
]]},
{'picture', [[image manual page7.png]]}
},
--------------------------------------------------------------
-- PAGE8
--------------------------------------------------------------
{
{'picture', [[image manual page8.png]]}
},
--------------------------------------------------------------
-- PAGE9
--------------------------------------------------------------
{
{'header1', [[[color=0xffffffff]ОРГАНЫ УПРАВЛЕНИЯ ВЕРТОЛЕТОМ]]},
{'text', [[
Основные органы управления вертолетом включают ручку управления, рычаг шаг-газ и педали противовращения. Ручка аналогична джойстику и служит для подъема или опускания носовой части и отклонения вертолета для поворота влево-вправо. Рычаг расположен сбоку от летчика и движется вверх-вниз для контроля тяги, вырабатываемой главным ротором, особенно для набора или сброса высоты (подъем/снижение). Педали служат для поворота (рыскания) носовой части влево или вправо вдоль линии горизонта с минимальным креном и для вращения вертолета при зависании.
При полете с видом из кабины, можно переключать индикатор панели управления нажатием [color=0x6090c0ff]RCTRL + ENTER[/color], чтобы визуально проверять положение органов управления полетом.
]]}
},
--------------------------------------------------------------
-- PAGE10
--------------------------------------------------------------
{
{'picture', [[image manual page10.png]]}
},

--------------------------------------------------------------
-- PAGE11
--------------------------------------------------------------
{
{'text', [[
Можно управлять вертолетом либо с помощью джойстика, либо клавиатуры. Однако, рекомендуется управление джойстиком с осью руля или отдельные педали руля. Ниже приводится пример конфигурации системы управления с джойстиком и с клавиатурой.
]]},
{'picture', [[image manual page11.png]]}
},
--------------------------------------------------------------
-- PAGE12
--------------------------------------------------------------
{
{'picture', [[image manual page12.png]]},
{'text', [[
Следует помнить, что вертолеты в полете неустойчивы и требуют постоянного и согласованного управления. Изменение положения одного из органов управления всегда требует соответствующей поправки для других органов управления. Если режим авионики Вам покажется слишком сложным, или же у Вас не хватает соответствующего оборудования для эффективного управления полетом, то режим упрощенной авионики предоставит ту же физику полета, но с большей устойчивостью и управляемостью.
Нажатием клавиш Подъем [color=0x6090c0ff]Num+[/color] или Снижение [color=0x6090c0ff]Num-[/color] уменьшается или увеличивается тяга, вырабатываемая главным ротором, в результате чего происходит набор или потеря высоты.
Нажатие клавиши Носовая часть вниз [color=0x6090c0ff]↑[/color] или отклонение джойстика вперед понижает носовую часть вертолета и увеличивает ускорение. Нажатие клавиши Носовая часть вверх [color=0x6090c0ff]↓[/color] или отклонение джойстика назад поднимает носовую часть и замедляет вертолет или заставляет его лететь назад при выходе из режима.
]]}
},
--------------------------------------------------------------
-- PAGE13
--------------------------------------------------------------
{
{'text', [[
Нажатие клавиши Повернуть направо [color=0x6090c0ff]→[/color] или налево [color=0x6090c0ff]←[/color] или отклонение джойстика в стороны заставит вертолет накрениться и начать поворот в соответствующую сторону. Чем больше угол крена, тем выше скорость поворота. Чтобы закончить поворачивать и вернуться к горизонтальному полету, накрените вертолет в противоложном от поворота направлении, пока горизонт снова не выровняется.
Нажатие клавиши Носовая часть влево [color=0x6090c0ff]Z[/color] или Носовая часть вправо [color=0x6090c0ff]X[/color] заставит вертолет повернуть носовую часть вправо или влево (движение рыскания) с минимальным креном аналогично повороту колеса в машине. Величина рыскания ограничена и сильно зависит от скорости полета. При быстром полете набегающий воздушный поток затрудняет движения рыскания вертолета в ответ. Орган управления рысканием используется в основном, чтобы управлять направлением вертолета в режиме зависания и для удержания прямого и горизонтального полета на высоких скоростях.
]]}
},
--------------------------------------------------------------
-- PAGE14
--------------------------------------------------------------
{
{'header1', [[[color=0xffffffff]ПРИБОРНАЯ ПАНЕЛЬ]]},
{'picture', [[image manual page14.png]]}
},
--------------------------------------------------------------
-- PAGE15
--------------------------------------------------------------
{
{'text', [[
1. Противобликовый козырек
2. Подсветка
3. Центральный сигнальный огонь
4. Сигнализация превышения частоты вращения винта
5. Клавиша проверки системы оповещения о пожаре
6. Светосигнализатор предупреждения о пожаре
7. Клавиша проверки указателя уровня топлива
8. Указатель воздушной скорости
9. Авиагоризонт
10. Двухстрелочный тахометр
11. Высотомер (AAU-31/A)
12. Авиагоризонт
13. Указатель радиокомпаса
14. Высотомер (AAU-32/A)
15. Вариометр
16. Держатель таблицы списания девиации компаса
17. Указатель давления топлива
18. Переключатель системы госопознавания с фиксатором
19. Светоиндикатор системы госопознавания
20. Указатель давления масла в системе редуктора
21. Амперметр основного генератора
22. Амперметр аварийного генератора
23. Указатель давления масла двигателя
24. Вольтметр переменного тока
25. Переключатель коррекции компаса
26. Вольтметр постоянного тока
27. Указатель температуры масла в системе редуктора
28. Указатель температуры масла двигателя
29. Топливомер
30. Указатель температуры выхлопных газов
31. Тахометр турбокомпрессора
32. Указатель крена и скольжения
33. Индикатор крутящего момента
34. Уровень звука маркерного радиомаяка
35. Переключатель направлений маркерных радиомаяков
]]}
},
--------------------------------------------------------------
-- PAGE16
--------------------------------------------------------------
{
{'text', [[
36. Светоиндикатор сброса вооружения
37. Часы
38. Сигнальная лампа маркерного радиомаяка
39. Указатель всенаправленного радиомаяка
40. Магнитный компас
41. Указатель радиокомпаса
42. Вариометр
]]},
{'header1', [[[color=0xffffffff]ЗАПУСК ВЕРТОЛЕТА]]},
{'text', [[
Автоматический запуск начинается при нажатии клавиш [color=0x6090c0ff]LWIN + HOME[/color].
Автоматическая остановка осуществляется при нажатии [color=0x6090c0ff]LWIN + END[/color].

1. Переключатели верхнего пульта и автоматы защиты цепи:
	• Переключатели переменного тока:
		+ Фазовый переключатель – на переменный ток. [color=0x6090c0ff]LSHIFT +R[/color]
		+ Переключатель преобразователя переменного тока – выключен. [color=0x6090c0ff]LSHIFT + I[/color]
	• Переключатели постоянного тока:
		+ Переключатель основного генератора – включить и закрыть защитной крышкой. [color=0x6090c0ff]LSHIFT +Q[/color]
		+ Переключатель векторного вольтметра – Режим основной шины. [color=0x6090c0ff]LSHIFT + H[/color]
		+ Переключатель стартера генератора – ПУСК. [color=0x6090c0ff]LSHIFT + X[/color]
		+ Переключатель гальванического элемента – включить. [color=0x6090c0ff]LSHIFT + P[/color]
]]},
},
--------------------------------------------------------------
-- PAGE17
--------------------------------------------------------------
{
{'picture', [[image manual page17.png]]},
{'text', [[
2 Переключатели центрального пульта:
	• Переключатель газового клапана– установить в автоматический режим. [color=0x6090c0ff]G[/color]
	• Переключатели топлива: 
		+ Переключатель основного топлива – включить. [color=0x6090c0ff]F[/color]
		+ Все остальные переключатели – выключены.
]]}
},
--------------------------------------------------------------
-- PAGE18
--------------------------------------------------------------
{
{'picture', [[image manual page18_1.png]]},
{'text', [[
	• Переключатель гидравлического регулятора – включить. [color=0x6090c0ff]LALT + I[/color] 
	• Переключатель балансировки сил – включить. [color=0x6090c0ff]LALT + U[/color] 
	• Стружкосигнализаторы – включить оба. [color=0x6090c0ff]LALT + V[/color]
]]},
{'picture', [[image manual page18_2.png]]},
{'text', [[
3 Рычаг дросселя – установить в стартовую позицию ([color=0x6090c0ff]PgDn[/color] х 3). Установите рычаг дросселя как можно ближе (со стороны убывания) к ограничителю режима малого газа двигателя.
]]}
},
--------------------------------------------------------------
-- PAGE19
--------------------------------------------------------------
{
{'picture', [[image manual page19.png]]},
{'text', [[
4 Двигатель:
	• Пусковой переключатель – нажмите и удерживайте; засеките время пускового периода. [color=0x6090c0ff]HOME[/color]
	• Несущий винт – Убедитесь, что несущий винт начнет вращаться, когда скорость турбокомпрессора достигнет 15%. Если винт не начал вращаться, прекратите запуск.
	• Пусковой переключатель – отпустите, когда скорость турбокомпрессора достигнет 40% или через 40 секунд в зависимости от того, что наступит раньше.
	• Рычаг дросселя – Медленно отклоняйте вперед до достижения стандартных оборотов в минуту. [color=0x6090c0ff]PgUp[/color]
	• Переключатель преобразователя переменного тока – включить в основном режиме. [color=0x6090c0ff]LSHIFT + U[/color]
]]}
},
--------------------------------------------------------------
-- PAGE20
--------------------------------------------------------------
{
{'header1', [[[color=0xffffffff]УПРАВЛЕНИЕ ПОЛЕТОМ]]},
{'header2', [[Взлет]]},
{'text', [[
Так как на вертолете UH-1H используется полозковое шасси, а не колесное, взлет обычно осуществляется при помощи вертикального ”подхвата” с земли в воздух с последующим продольным ускорением и набором высоты для перехода в горизонтальный полет. Поначалу выполнение вертикального взлета может представлять трудности, особенно при игре в режиме симуляции, так как он требует слаженного последовательного и плавного управления ручкой, педалями и рычагом газа.
]]},
{'picture', [[image manual page20.png]]},
{'text', [[
Перед началом взлета плавно поднимите рычаг газа ([color=0x6090c0ff]Num+[/color]). Ручку управления обычно нужно при этом отклонить назад и влево (примерно на 20% в указанных направлениях) для сохранения устойчивости. Также нужно утопить левую педаль примерно на 30% хода, чтобы вертолет не отклонился вправо. Продолжайте [b]медленно[/b] поднимать рычаг газа и аккуратно управляйте ручкой управления и педалями для удержания позиции носовой части и предотвращения скольжения по земле. Если все выполнено правильно, то вертолет медленно оторвется от земли и перейдет в устойчивое зависание на низкой высоте с минимальными изменениями положения и направления.
]]}
},
--------------------------------------------------------------
-- PAGE21
--------------------------------------------------------------
{
{'text', [[
Поднявшись на высоту нескольких футов над землей, немного опустите носовую часть, слегка отпустив ручку управления, чтобы начать продольное ускорение. Немного поднимите рычаг газа, одновременно двигая ручку управления вперед, для предотвращения потери высоты из-за опускания носовой части.
Ниже приводится пример приблизительного положения органов управления полетом во время вертикального взлета, висения и вертикальной посадки:
]]},
{'picture', [[image manual page21.png]]},
{'text', [[
Для движения вперед держите носовую часть вертолета немного опущенной вниз. Для снижения скорости – поднимите носовую часть (для этого потяните ручку управления назад). Если носовая часть вертолета остается задранной после того, как он перестал двигаться вперед, он начнет лететь назад. Используйте рычаг газа ([color=0x6090c0ff]Num+[/color] / [color=0x6090c0ff]Num-[/color]) для увеличения/уменьшения количества подъемной силы, вырабатываемой винтом, и контролируйте высоту во время подъема или опускания носовой части.
]]}
},
--------------------------------------------------------------
-- PAGE22
--------------------------------------------------------------
{
{'picture', [[image manual page22_1.png]]},
{'text', [[
С ростом скорости вертолета, носовая часть будет стремиться подниматься. Будьте готовы к этому и для введения поправки отклоните вперед ручку управления. При переходе из висения в полет вперед при скорости свыше 30 узлов, ручка управления передвинется с положения “сзади и слева” в положение “примерно спереди и по центру”. Соответственно, с ростом скорости вертолета меньше требуется управление педалями. На высоких скоростях, свыше 80 узлов, вертолет будет стремиться накрениться влево, поэтому также будет необходимо отклонить ручку управления вправо, чтобы сохранять горизонтальный полет.
]]},
{'header2', [[Поворот]]},
{'picture', [[image manual page22_2.png]]}
},
--------------------------------------------------------------
-- PAGE23
--------------------------------------------------------------
{
{'text', [[
Если вертолет находится в горизонтальном полете, то поворот осуществляется посредством крена в сторону поворота ([color=0x6090c0ff]←[/color] / [color=0x6090c0ff]→[/color] или ручка управления вправо/влево). Скорость поворота может быть увеличена за счет дополнительного нажатия педалей в сторону поворота и незначительного отклонения ручки управления.
В режиме висения или на малых скоростях вертолет можно повернуть с помощью педалей ([color=0x6090c0ff]Z[/color] / [color=0x6090c0ff]X[/color]) для поворота носовой части вдоль горизонта.
]]},
{'header2', [[Висение]]},
{'text', [[
Один из наиболее существенных навыков управления вертолетом – это умение добиваться режима висения. Как и взлет, висение требует аккуратного, плавного и слаженного управления.
Для перехода в режим висения из режима горизонтального полета, сначала потребуется сбавить скорость полета без потери высоты. Для этого одновременно поднимите носовую часть примерно на 20 градусов, отклонив назад ручку управления, и [b]уменьшите[/b] газ рычагом газа, чтобы не набрать высоту. Внимательно следите за указателями вертикальной скорости и скорости полета. Когда Ваша скорость опустится ниже 50 узлов, будьте готовы [b]увеличить[/b] газ рычагом газа и опустить носовую часть, чтобы добиться позиции почти висения при низкой скорости полета. Очень важно вовремя увеличить газ рычагом газа, когда Ваша скорость будет ниже 30 узлов, чтобы не попасть в режим вихревого кольца, в котором вертолет “всасывается” в собственный скос потока и начинает стремительно падать на землю.
Следует помнить, что увеличение и уменьшение газа рычагом газа всегда требует соответствующих поправок положения ручки управления и педалей для сохранения устойчивости полета. Как правило, увеличение газа рычагом газа обычно также требует отклонения носовой части вправо, вводя поправку дополнительным нажатием левой педали. Напротив, уменьшение газа рычагом газа обычно требует отклонения носовой части влево, вводя поправку дополнительным нажатием правой педали.
]]}
},
--------------------------------------------------------------
-- PAGE24
--------------------------------------------------------------
{
{'header2', [[Посадка]]},
{'text', [[
Для выполнения посадки начните устойчивое снижение к месту посадки. Старайтесь, чтобы скорость полета была около 80 узлов, и контролируйте скорость снижения при помощи рычага газа и ручки управления. Старайтесь войти в режим висения над местом посадки, а затем аккуратно уменьшайте газ рычагом газа, чтобы посадить вертолет на землю.
Возможна также посадка с пробегом, когда вертолет приземляется с некоторой горизонтальной скоростью перемещения и затормаживается до полной остановки на земле.
]]},
{'header2', [[Балансировка]]},
{'text', [[
Во время полета ручка управления и педали вертолета редко находятся в нейтральном положении. В настоящем вертолете пилот может нажать кнопку управления триммером на ручке управления, чтобы зафиксировать органы управления в текущем положении. Однако, так как большинство контроллеров ПК не располагают подобной возможностью балансировки, специальная функция балансировки предусмотрена в данном авиасимуляторе.
Чтобы зафиксировать органы управления в текущем положении, нажмите и отпустите кнопку управления триммером [color=0x6090c0ff]T[/color], а затем быстро верните ручку управления и педали в нейтральное положение. Можно отменить балансировку в любой момент, нажав [color=0x6090c0ff]LCTRL + T[/color].
]]},
{'picture', [[image manual page24.png]]}
},
--------------------------------------------------------------
-- PAGE25
--------------------------------------------------------------
{
{'header1', [[[color=0xffffffff]ПРИМЕНЕНИЕ ОРУЖИЯ]]},
{'text', [[
Вертолет UH-1H, представленный в данном авиасимуляторе, оснащен системой вооружения M23 и подсистемой M21. Система вооружения M23 включает два поворотных пулемета M60D, которые использовались воздушными стрелками. Подсистема вооружения M21 включает миниганы M134 и ракетные пусковые установки, подвешенные на внешнии станции вооружения вертолета.
]]},
{'header2', [[Индикатор систем вооружения и режима работы автопилота]]},
{'text', [[
Вертолет UH-1H, представленный в данном авиасимуляторе, имеет специальный индикатор систем вооружения и режима работы автопилота справа на экране, чтобы помочь быстро оценить состояние Ваших систем вооружения и режимы автопилота, а также получить подсказки по управляющим клавишам. Можно включать и выключать дисплей нажатием клавиш [color=0x6090c0ff]LCTRL + LSHIFT + H[/color].
]]},
{'picture', [[image manual page25.png]]}
},
--------------------------------------------------------------
-- PAGE26
--------------------------------------------------------------
{
{'text', [[
[b]ДОСТУПНОЕ ОРУЖИЕ.[/b] Показывает вооружение, имеющееся в распоряжении на вертолете на данный момент.

[b]НАСТРОЙКА ВЫКЛЮЧАТЕЛЯ БОЕВОЙ ЦЕПИ.[/b] Показывает положение выключателя боевой цепи (ОТКЛЮЧЕН/НА ПРЕДОХРАНИТЕЛЕ/БОЕВОЙ-OFF/SAFE/ARMED) и управляющие клавиши, переключающие его положение. Чтобы открыть огонь, выключатель должен быть в положении БОЕВОЙ.

[b]АКТИВНОЕ ОРУЖИЕ.[/b] Показывает выбранное (активное) в данный момент оружие, остаток боекомплекта, а также управляющие клавиши для выбора другого оружия.

[b]НАСТРОЙКИ СТРЕЛЬБЫ.[/b] Показывает настройки стрельбы для выбранного оружия, а также управляющие клавиши для их переключения. При выборе минигана М134 можно вести огонь из левого, правого и обоих блоков стволов, находящихся с обеих сторон вертолета. При выборе ракетных пусковых установок настройка стрельбы показывает максимальное количество пар ракет, которые можно выпустить, пока нажат спусковой крючок.

[b]СОСТОЯНИЯ АВТОПИЛОТА.[/b] Показывает состояние автопилота (включен/выключен), а также управляющие клавиши для его переключения.

[b]РЕЖИМ АВТОПИЛОТА.[/b] Показывает выбранный в данный момент режим автопилота (СТАБИЛИЗАЦИЯ ПРОСТРАНСТВЕННОГО ПОЛОЖЕНИЯ/ГОРИЗОНТАЛЬНЫЙ ПОЛЕТ/ПОЛЕТ ПО КРУГУ).

[b]ПОДСКАЗКА СТАБИЛИЗАЦИИ ПРОСТРАНСТВЕННОГО ПОЛОЖЕНИЯ.[/b] Показывает управляющие клавиши для выбора режима автопилота СТАБИЛИЗАЦИЯ ПРОСТРАНСТВЕННОГО ПОЛОЖЕНИЯ.
[b]ПОДСКАЗКА ГОРИЗОНТАЛЬНОГО ПОЛЕТА.[/b] Показывает управляющие клавиши для выбора режима автопилота ГОРИЗОНТАЛЬНЫЙ ПОЛЕТ.
[b]ПОДСКАЗКА ПОЛЕТА ПО КРУГУ.[/b] Показывает управляющие клавиши для выбора режима автопилота ПОЛЕТ ПО КРУГУ.
]]}
},
--------------------------------------------------------------
-- PAGE27
--------------------------------------------------------------
{
{'header2', [[Система вооружения M23]]},
{'text', [[
Чтобы воспользоваться дверными пулеметами M60D системы вооружения М23, просто нажмите [color=0x6090c0ff]3[/color] или [color=0x6090c0ff]4[/color] , чтобы занять место стрелка с выбранной стороны.
]]},
{'picture', [[image manual page27.png]]},
{'text', [[
Для прицеливания нажмите [color=0x6090c0ff]LALT + C[/color] , чтобы включить режим управления поворотом мыши. После его включения можно прицеливаться миниганом с помощью мыши и стрелять нажатием [color=0x6090c0ff]SPACE[/color]. Можно воспользоваться колесиком мыши или клавишами [color=0x6090c0ff]Num*[/color] и [color=0x6090c0ff]Num/[/color] для увеличения и уменьшения масштаба, а также корректировать пространственное положение поля зрения, удерживая колесико мыши, одновременно двигая мышь.
Когда Вы переключаетесь для игры от лица стрелка, то автоматически включается автопилот, и вертолет летит в соответствии с заданным режимом автопилота. Можно включить и выключить автопилот в любой момент нажатием [color=0x6090c0ff]LWIN + A[/color].
]]}
},
--------------------------------------------------------------
-- PAGE28
--------------------------------------------------------------
{
{'header2', [[Подсистема вооружения M21]]},
{'text', [[
Подсистема вооружения М21 состоит из двух высокоскорострельных шестиствольных миниганов M134 калибром 7,62 мм и двух ракетных пусковых установок M158, в блоках которых находятся 7 неуправляемых ракет калибром 2,75 дюйма.
]]},
{'header3', [[[color=0xffffffff]Миниган М134 калибром 7,62 мм]]},
{'text', [[
Пулеметы М134 могут стрелять либо в походном режиме, либо в подвижном режиме. В походном режиме стволы направлены вперед и наводятся доворотом носовой части вертолета прямо на цель. В подвижном режиме стволы могут направляться горизонтально и вертикально, с помощью универсального прицела левого пилота указывая на цель, позволяя правому пилоту улетать на вертолете от цели, в то время как левый пилот стреляет.
Левый пилот может стрелять из подсистемы пулеметов калибром 7,62 мм как в походном режиме, так и в подвижном режиме, тогда как правый пилот может стрелять из данной подсистемы только в походном режиме.
]]},
{'header3', [[[color=0xffffffff]Походный режим]]},
{'text', [[
Пулеметы можно убирать в фиксированное положение, и из них могут стрелять левый или правый пилоты, как из неподвижно установленного оружия. Это позволяет стрелять прямо вперед в случае чрезвычайной ситуации с помощью кнопки стрельбы на ручке управления пилота или стрелка. Чтобы открыть огонь из пулеметов в походном положении, нужно повернуть переключатель выбора вооружения на “7.62” ([color=0x6090c0ff]RALT + ] [/color] / [color=0x6090c0ff]RALT + [ [/color]) и переключить выключатель боевой цепи OFF-SAFE-ARMED в положение ARMED ([color=0x6090c0ff]RSHIFT + ] [/color] / [color=0x6090c0ff]RSHIFT + [ [/color]).
Пилот использует коллиматорный прицел XM60 для стрельбы в походном режиме, поворачивая кнопку понижения угла места, пока прицельная метка не совпадет с местом попадания пуль.
Пока коллиматорный прицел XM60 не реализован в данном авиасимуляторе, у пилота есть временная прицельная метка вместо него. Эту метку можно включать и выключать нажатием [color=0x6090c0ff]M[/color].
]]}
},
--------------------------------------------------------------
-- PAGE29
--------------------------------------------------------------
{
{'picture', [[image manual page29.png]]},
{'header3', [[[color=0xffffffff]Подвижный режим]]},
{'text', [[
Для использования пулеметов в подвижном режиме: 
	• Отключите походный режим прицельной станции [color=0x6090c0ff]M[/color]
	• Прицельтесь, двигая прицельную станцию с помощью клавиш Numpad [color=0x6090c0ff]←[/color] / [color=0x6090c0ff]→[/color] / [color=0x6090c0ff]↑[/color] / [color=0x6090c0ff]↓[/color] , или включите режим управления поворотом мыши, нажав [color=0x6090c0ff]LALT + C[/color] , чтобы прицелиться с помощью мыши. 
	• Откройте огонь нажатием клавиши [color=0x6090c0ff]SPACE[/color].
При включении подвижного режима появляется надпись “Подвижный режим включен - Flexible Mode Active” на индикаторе систем вооружения и режимов работы автопилота.

Когда Вы играете от лица левого пилота, и когда подвижный режим включен, автопилот включается автоматически, и вертолет летит в соответствии с заданным режимом автопилота. Можно включить и выключить автопилот вручную нажатием [color=0x6090c0ff]LWIN + A[/color]. Автопилот включается, если соблюдены следующие условия:
	• Включен подвижный режим
	• Выключатель OFF-SAFE-ARMED находится в положении ARMED
]]}
},
--------------------------------------------------------------
-- PAGE30
--------------------------------------------------------------
{
{'picture', [[image manual page30_1.png]]},
{'picture', [[image manual page30_2.png]]}
},
--------------------------------------------------------------
-- PAGE31
--------------------------------------------------------------
{
{'header3', [[[color=0xffffffff]Неуправляемые ракеты в M158 калибром 2,75 дюймов]]},
{'text', [[
Пусковые установки ракет калибром 2,75 дюймов закреплены на опоре в сборе, и ими можно стрелять только из походного положения. Когда переключатель выбора вооружения находится в положении “2.75”, то основной режим подсистемы – стрельба ракетами с помощью кнопок стрельбы на ручках управления.
Для применения неуправляемых ракет: 
	• Установите переключатель выбора вооружения на “2.75”. [color=0x6090c0ff]RALT + ] [/color] / [color=0x6090c0ff]RALT + [ [/color]
	• Установите переключатель ВЫБОРА ПАР- PAIR SELECTOR ракет (на желаемое количество пар ракет, выпускаемых одновременно). [color=0x6090c0ff]RCTRL + ] [/color] / [color=0x6090c0ff]RCTRL + [ [/color]
	• Установите выключатель OFF-SAFE-ARMED в положение ARMED и убедитесь, что индикатор SAFE погас, а индикатор ARMED загорелся. [color=0x6090c0ff]RSHIFT + ] [/color] / [color=0x6090c0ff]RSHIFT+ [ [/color]
	• Используя прицельную метку в качестве опорной точки наводки, захватите цель, летя к цели по встречному курсу, корректируя пространственное положение вертолета при необходимости, чтобы совместить прицельную метку с целью.
	• Когда цель вошла в прицел, пускайте ракеты, нажав кнопку стрельбы на ручке управления. [color=0x6090c0ff]SPACE[/color]
Пока коллиматорный прицел XM60 не реализован в данном авиасимуляторе, у пилота есть временная прицельная метка вместо него. Эту метку можно включать и выключать нажатием. [color=0x6090c0ff]M[/color]
]]}
}
}