Ammo_guided = {--строки 3-958
	--1)сначала missiles / Стоимость писать как ДОЛЮ от стоимости в соотношении
	-- к AIM-120C, выраженную в $
	--если СП НЕ несет угрозу для ЛА (например, ракета воздух-корабль), 
	--то для нее прописывается ТОЛЬКО  стоимость [CP]
	--30.07.2019 принял 1млн $ =2.0
	
	['9M317']= {--Китайский Buk SA-11 (Buk)	China\navy\Type 052B Destroyer
	--Su-27, Alt 10000 m, speed 1000 km/h,  
	--head to head	47	44	29	27	
		['v_avrg'] = 2000,
		['p_dstr'] = 0.75,
		['t_aim']  = 10,
		['d_max'] = 25000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.6,--одной ракеты (тест)
	},	
	['AGM_114'] = {   -- AGM-114L Longbow Hellfire, тандемная кум. БЧ, пустил-забыл. ________Не используется
		['v_avrg'] = 250,
		['p_dstr'] = 0.2,
		['t_aim'] = 15,
		['d_max'] = 6000, --16.11 Апач атакует висящий вертолет с 6 000
		['CP']=0.23--0.094,--25.000 $,  а потом  - 117.000 на 2017год
	},
	['AGM_114K']= {  --AH-64D
		['v_avrg'] = 250,
		['p_dstr'] = 0.2,
		['t_aim'] = 15,
		['d_max'] = 6000, --16.11 Апач атакует висящий вертолет с 6 000
		['CP']=0.23--0.094,--65.000 $///AIM-120=1.721| R-77=1.653| AGM-65D=1.025| R-73=0.475
	},			--AGM-114=0.094| R-60M=0.071| AIM-7M=1.203
	['AGM_119']= {--1.125...1.052 млн $ ПКР,  SH-60B, F-16A\MLU
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=2.25--1.5,
	},
	['AGM_122']= {--Sidearm аналог AIM-9P, но для подавления РЛС на малой дальности (легкая), AV-8BN/A
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.36--1.4,--$181000 AIM-9P5=1.4
	},
	['AGM_123']= {--как бомба mk.83 но с двигателем, дальность 7км, лазер, ____________вроде не используется
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.23--0.094,--как AGM-114 (примерно)
	},
	['AGM_130']= {--как GBU-15 (УАБ)+ двигатель, _______________не используется
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.4--1.45,--GBU-15=195-300.000$
	},
	['AGM_154']= {--планирующая бомба, вес 495кг, цена -соответствующая бомбам GBU, B-52, F-15E
		['v_avrg'] = 0,--прим.1/2 стоимости GBU-15 (вес которой 1.100кг)
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.4--0.96,
	},
	['AGM_45']= { --ПРР Шрайк, F-4E
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.18--0.094,
	},
	['AGM_62']= {-- Walley, УАБ со времен Вьетнама F-18C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.06
	},				
	['AGM_65D']= { --IR Maveric, A-10C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2--1.025,--в районе 100.000$--65.000 $///AIM-120=1.721| R-77=1.653| AGM-65D=1.025| R-73=0.475
	},				--AGM-114=0.094| R-60M=0.071| AIM-7M=1.203
	['AGM_65E']= { --Laser Maveric, F-18C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2--1.025,
	},
	['AGM_65G']= { --HE IR Maveric, A-10C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2--1.025,
	},
	['AGM_65H']= { -- CCD(ПЗС-матрица) maveric, A-10C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2--1.025,
	},
	['AGM_65K']= { -- CCD(ПЗС-матрица) maveric, A-10C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2--1.025,
	},
	['AGM_84A']= { -- ПРР HARPOON, F-18C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0--1.7,--500.000$ (примерно)
	},
	['AGM_84E']= { -- ПРР HARPOON, F-18C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.2--1.7,
	},
	['AGM_84S']= { --ПРР HARPOON, наверное имелась ввиду версия "C", _____________не нашел где используется
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=2.4--1.7,
	},
	['AGM_86']= {--КР, B-52
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=3.6--1.99,--1млн примерно на 1986г, значит 1.078 млн на 2018, а доработка до D еще + 800тыс...
	},
	['AGM_88']= {--HARM, F-18C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.6,--300-994.000$
	},
	['AIM_120']= { --AIM 120B AMRAAM, F-15C
		['v_avrg'] = 1000,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 25000,--уточнено 23.09.2019, экспертная оценка
		['CP']=1.8--1.721,--хотя по расчетам 1.72 коэфф.должен быть...1.200.000$ в среднем
	},
	['AIM_120C']= { --AMRAAM 120C, F-15C
		['v_avrg'] = 1100,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 25000,
		['CP']=2.4--1.721,
	},
	['AIM_54']= {-- AIM-54C Phoenix, F-14A
		['v_avrg'] = 650,
		['p_dstr'] = 0.54,--уточнено 23.09.2019, экспертная оценка
		['t_aim'] = 15,
		['d_max'] = 30000,
		['CP']=0.95,--$477 131
	},
	['AIM_7']= { -- AIM-7M Sparrow, F-15C
		['v_avrg'] = 750,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 27000,--уточнено 23.09.2019, экспертная оценка
		['CP']=1.2,--4.2, стоимость:US$125-165,4 тыс. по сделке 1990г - 358.646 
					--или 715.000 на 2019г
	},
	['AIM-7E'] = {--старее, чем -7F, F-15C
		['v_avrg'] = 750,
		['p_dstr'] = 0.55,
		['t_aim'] = 10,
		['d_max'] = 18000,
		['CP']=1.4,
	},
	['AIM-7F'] = { --F-15C
		['v_avrg'] = 750,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 21500,--уточнено 18.11.2019, экспертная оценка
		['CP']=1.43,
	},
	['AIM-7MH'] = { --F-15C
		['v_avrg'] = 600,
		['p_dstr'] = 0.60,
		['t_aim'] = 10,
		['d_max'] = 22000,--уточнено 18.11.2019, экспертная оценка
		['CP']=1.43,
	},
	['AIM_9']= {-- AIM-9M, F-15C есть в \Scripts\Database\Weapons\missiles_data.lua
		['v_avrg'] = 700,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 6000,--уточнено 18.11.2019, экспертная оценка
		['CP']=0.3--1.4,--9L - с учетом инфляции=$181.000
	},
	['AIM-9L']= {-- находится, F-15C \LockOnExe\CoreMods\aircraft\AircraftWeaponPack\aim9_family.lua
		['v_avrg'] = 700,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 6000,--уточнено 18.11.2019, экспертная оценка
		['CP']=0.3--1.4,--9L - с учетом инфляции=$181.000
	},
	['AIM_9P']= {--  F-15C, есть в \Scripts\Database\Weapons\missiles_data.lua
		['v_avrg'] = 700,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 4500,--уточнено 23.09.2019, затем 14.10.2019 4000->4500 экспертная оценка
		['CP']=0.26--1.4,--9P старше, чем 9M, которая с учетом инфляции=$151.000, использую 130.000
	},
	['AIM-9P5'] = { -- F-15C
		['v_avrg'] = 700,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 6000,--уточнено 18.11.2019, экспертная оценка
		['CP']=0.36--1.4,
	},
	['AIM_9X']= {-- F-18C, есть в \Scripts\Database\Weapons\missiles_data.lua
		['v_avrg'] = 700,
		['p_dstr'] = 0.85,
		['t_aim'] = 5,
		['d_max'] = 6500,--уточнено 18.11.2019, экспертная оценка
		['CP']=1.07--1.6,--9X - с учетом инфляции=$536.000 или 
		--AIM-9X Sidewinder	SRAAM	2013	2014-2015	(80)	$40 m deal; AIM-9X Block-2 version
	},
	['ALARM']= {--  ПРР, Tornado GR4 
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.6,
	},
	['AT_6']= {--as AGM-114, Mi-24V
		['v_avrg'] = 420,
		['p_dstr'] = 0.2,
		['t_aim'] = 15,
		['d_max'] = 3500,--уточнено 23.09.2019, экспертная оценка
		['CP']=0.18--1.0,--принял за 90.000--было 3.0
	},
	['AT_9M120']= {--as AGM-114L  _________________не используется
		['v_avrg'] = 420,
		['p_dstr'] = 0.3,
		['t_aim'] = 10,
		['d_max'] = 4500,--уточнено 23.09.2019, экспертная оценка
		['CP']=0.23--1.0,--115.000--было 4.0
	},
	['AT_9M120M']= { -- ____________________не используется
		['v_avrg'] = 420,
		['p_dstr'] = 0.3,
		['t_aim'] = 10,
		['d_max'] = 4500,--уточнено 23.09.2019, экспертная оценка
		['CP']=0.23--1.0,
	},
	['Ataka_T']= { -- ______________________не используются
		['v_avrg'] = 420,
		['p_dstr'] = 0.3,
		['t_aim'] = 10,
		['d_max'] = 4500,--уточнено 23.09.2019, экспертная оценка
		['CP']=0.23--1.0,
	},
	['BGM_109B']= {--томогавк, Ticonderoga
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=15.42,--с учетом инфляции $7.710.000 согласно 1995	1997-1998	(65)	GBP180 m ($316 m) deal; BGM-109 T-LAM Block-III version; for Swiftsure and Trafalgar submarines
	},
	['DEFA554_30_HE'] = {-- пушка M-2000C
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,--0.05 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 1200,--400
		['CP']=0.0001,
	},
	['FIM_92B']= { -- Stinger MANPADS _______________________не используется
		['v_avrg'] = 750,
		['p_dstr'] = 0.7,
		['t_aim'] = 13,
		['d_max'] = 3500,--4000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.14--1.4,--$70.000
	},
	['FIM_92C']= { -- Stinger MANPADS
		['v_avrg'] = 750,
		['p_dstr'] = 0.7,
		['t_aim'] = 13,
		['d_max'] = 3500,--4000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.14--1.4,
	},
	['GAR-8'] = { -- AIM-9,  F-86F
		['v_avrg'] = 500,
		['p_dstr'] = 0.4,
		['t_aim'] = 15,
		['d_max'] = 3100,-- уточн 14.10.19 (было 2000-23.09.2019)
		['CP']=0.1--0.9,
	},
	['GBU_10']= { -- Laser bomb, F-15E
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.1--0,
	},	
	['GBU_12']= { -- Laser bomb, F-15E
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.043,--1/2 GBU-10
	},
	['GBU_15']= {--AGM-112, но не было окончательно присвоено, TV bomb 
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.577,--300.000
	},
	['GBU_16']= { --Laser bomb, F-18C
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.07,--$16.000
	},
	['GBU_22']= {--как GBU-12, но толще стенки корпуса, laser bomb
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.05,
	},
	['GBU_24']= { -- laser bomb____________________Не используется
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.15,--$75.000
	},
	['GBU_27']= { --Laser bomb, F-117
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.14,--$70.000
	},
	['GBU_28']= { --Laser bomb ___________Не используется
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.264,--$132.000
	},
	['HAWK_RAKETA']= {-- Зур Хок
		['v_avrg'] = 650,
		['p_dstr'] = 0.55,
		['t_aim'] = 15,
		['d_max'] = 25000,--28000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.5,--$250.000
	},
	['HY-2'] = {	--ПКР Китай, береговая,
	--Китайская версия п15 термит, а пусковая для нее=hy_launcher, радар=Silkworm_SR 
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.4,
	},	
	['HHQ-9']= {--китайская версия С-300, за основу взят ЗУР С-300ПМУ, Type 052C Destroyer
		['v_avrg'] = 1200,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 30000,--25000 уточнено 23.09.2019, экспертная оценка
		['CP']=3.0,--прим.$1.500.000
	},
	['HQ-7']= {--китайская версия ЗРК «Crotale», 
		['v_avrg'] = 1200,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 9000,
		['CP']=0.3,
	},	
	['HQ-16']= {--китайская версия корабельного ЗРК Шторм, за основу взят Бук, Type 054A Frigate
		['v_avrg'] = 2000,
		['p_dstr'] = 0.75,
		['t_aim']  = 10,
		['d_max'] = 30000,--исправлено 18.11, экспертная оценка
		['CP']=1.6,--одной ракеты (тест)
	},
	['Igla_1E']= { -- ПЗРК Игла
		['v_avrg'] = 750,
		['p_dstr'] = 0.60,
		['t_aim'] = 13,
		['d_max'] = 3500,--4500 уточнено 23.09.2019, экспертная оценка
		['CP']=0.2,
	},
	['KAB_1500Kr']= {--GBU-31 Су-24М
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.14,
	},	
	['KAB_500']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.07,--GBU-16
	},	
	['KAB_500Kr']= { --Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.07,
	},	
	['KAB_500KrOD']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.07,
	},		
	['KONKURS']= { --BMP-2
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.05,
	},
	['Kormoran']= { --Tornado IDS
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.15,
	},
	['MALUTKA']= { --BMD-1
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.02,
	},
	['MMagicII']= {--as AIM-9M--добавлено 14.10.2019, M-2000C
		['v_avrg'] = 700,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 4000,--4000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.3--1.4,--9L - с учетом инфляции=$181.000
	},
	['Matra_S530D']= {--франц. УР В-В,  M-2000C
		['v_avrg'] = 550,
		['p_dstr'] = 0.55,
		['t_aim'] = 15,
		['d_max'] = 12000, -- дальность обстрела цели (h=2000м,v=500кмч)
		['CP']=1.430,
	},
	['MICA_R']= {--франц.ав.ракета, Mirage 2000-5
		['v_avrg'] = 1000,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 10000,----30000 уточнено 18.11.2019, экспертная оценка
		['CP']=2.0,--Чиж написал, что она аналог AIM-120B
	},
	['MICA_T']= { -- Mirage 2000-5
		['v_avrg'] = 1000,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 10000,----30000 уточнено 18.11.2019, экспертная оценка
		['CP']=2.0,
	},
	['MIM_104']= {-- SAM Patriot
		['v_avrg'] = 1200,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 30000,
		['CP']=9.00,--$4.500.000
	},
	['MIM_72G']= {--ИК Чапарэл, M48 Chaparral
		['v_avrg'] = 600,
		['p_dstr'] = 0.4,
		['t_aim'] = 15,
		['d_max'] = 4000,--6300 уточнено 23.09.2019, экспертная оценка
		['CP']=0.06,
	},
	['Mk_50_Torpedo']= {--торпеда для прим с самолета/корабля
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.1,
	},
	['P_120']= {--П-120, РФ крылатая противокорабельная ракета.
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.60,
	},
	['P_15U']= {--П-15У - старая ПКР СССР
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.4,
	},
	['P_24R']= {--по Чижу=AIM-7E, mig23mld
		['v_avrg'] = 600,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 16000,--25000 уточнено 18.11.2019, экспертная оценка
		['CP']=1.4,
	},
	['P_24T']= { -- mig23mld
		['v_avrg'] = 600,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 10000,--25000 уточнено 18.11.2019, экспертная оценка
		['CP']=1.4,
	},
	['P_27AE']= { -- _____________________не используется
		['v_avrg'] = 900,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 25000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,
	},
	['P_27EM']= { -- ________________________не используется
		['v_avrg'] = 900,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 25000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,
	},
	['P_27P']= { -- Су-27
		['v_avrg'] = 900,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 16000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,
	},
	['P_27PE']= { -- Су-27
		['v_avrg'] = 900,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 28000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,
	},
	['P_27T']= { -- Су-27 
		['v_avrg'] = 900,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 12000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,
	},
	['P_27TE']= { -- Су-27
		['v_avrg'] = 900,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 15000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,
	},
	['P_33E']= { -- Mig-31
		['v_avrg'] = 900,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 30000,
		['CP']=0.954,
	},
	['P_35']= {--П-35, ПКР РФ
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0,--как Гарпун (прим.)
	},
	['P_37']= {--как AIM-54, но дальность до 300км ________________________ не используется
		['v_avrg'] = 900,
		['p_dstr'] = 0.75,
		['t_aim'] = 15,
		['d_max'] = 30000,
		['CP']=1.6,--800.000 (оценочно)
	},
	['P_40R']= { -- МиГ 25ПД
		['v_avrg'] = 800,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 19000,--20000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.40,
	},
	['P_40T']= { -- МиГ 25ПД
		['v_avrg'] = 800,
		['p_dstr'] = 0.5,
		['t_aim'] = 15,
		['d_max'] = 15000,--25000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.40,
	},
	['P_500']= { -- П-500 «Базальт»
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0,--прим.как Гарпун AGM-84
	},
	['P_60']= { --Р-60М, МиГ-29С
		['v_avrg'] = 750,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 3000,
		['CP']=0.2,--согласно расчету
	},
	['P_700']= { --П-700 гранит, ТАКР Кузнецов
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0,
	},
	['P_73']= { --  МиГ-29С
		['v_avrg'] = 900,
		['p_dstr'] = 0.65,
		['t_aim'] = 10,
		['d_max'] = 6000,--20000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.4,
	},
	['P_77']= { --Миг-29С
		['v_avrg'] = 1200,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 18000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.6,
	},
	['P_9M117']= { -- BMP-3
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.06,
	},
	['P_9M133']= { -- Птур Корнет _____________Не используется
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.1,
	},
	['R_17'] = {--SCUD
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=13.86,--на 1958 г =800.000руб
	},
	['Rb 24']= {--as AIM-9j --уточнено название 14.10.2019, AJS-37
		['v_avrg'] = 700,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 4500,
		['CP']=0.3--1.4,--9L - с учетом инфляции=$181.000
	},
	['Rb 24J']= {--as AIM-9j--уточнено название 14.10.2019,  AJS-37
		['v_avrg'] = 700,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 4500,
		['CP']=0.3--1.4,--9L - с учетом инфляции=$181.000
	},
	['Rb 74']= {--as AIM-9M--уточнено название 14.10.2019,   AJS-37
		['v_avrg'] = 700,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 6000,
		['CP']=0.3--1.4,--9L - с учетом инфляции=$181.000
	},
	['R_85']= {--ПКР
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.4,--оценочно=$200.000
	},
	['R_85U']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.4,
	},
	['R-13M'] = {--AIM-9D по Чижу,  MiG-21Bis
		['v_avrg'] = 500,
		['p_dstr'] = 0.3,
		['t_aim'] = 15,
		['d_max'] = 6000,----6500 уточнено 23.09.2019, экспертная оценка
		['CP']=0.2,--прим.$100.000
	},
	['R-13M1'] = {--AIM-9D по Чижу,  MiG-21Bis
		['v_avrg'] = 500,
		['p_dstr'] = 0.3,
		['t_aim'] = 15,
		['d_max'] = 6000,----6500 уточнено 23.09.2019, экспертная оценка
		['CP']=0.2,
	},
	['R-3R'] = {--  MiG-21Bis
		['v_avrg'] = 400,
		['p_dstr'] = 0.2,
		['t_aim'] = 15,
		['d_max'] = 6000,
		['CP']=0.14,--прим.$70.000
	},
	['R-3S'] = { --   MiG-21Bis
		['v_avrg'] = 400,
		['p_dstr'] = 0.3,
		['t_aim'] = 15,
		['d_max'] = 5000,
		['CP']=0.14,
	},
	['R_550'] = { -- Magic 2, Mirage 2000-5
		['v_avrg'] = 400,
		['p_dstr'] = 0.3,
		['t_aim'] = 15,
		['d_max'] = 7500,
		['CP']=0.14,
	},
	['Rapier'] = {--ЗРК Рапира--добавлено 14.10.2109
		['v_avrg'] = 450,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 9000,
		['CP']=0.2,--прим.100.000
	},	
	['REFLEX']= {--ПТУР через 125мм пушку
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.04,
	},
	['RIM_116A'] = {--корабельный ЗРК (ИК), авианосец Nimitz
		['v_avrg'] = 450,
		['p_dstr'] = 0.5,
		['t_aim'] = 10,
		['d_max'] = 7000,
		['CP']=0.2,--прим.100.000
	},
	['ROLAND_R']= { --Roland ADS
		['v_avrg'] = 500,
		['p_dstr'] = 0.4,
		['t_aim'] = 15,
		['d_max'] = 8500,
		['CP']=0.14,
	},
	['S_25L']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.04,
	},
	['SA2V755']= {--С-75--добавлено Ромой 14.10.2019
		['v_avrg'] = 1200,
		['p_dstr'] = 0.6,
		['t_aim'] = 15,
		['d_max'] = 30000,--25000--20000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.8,
	},
	['SA3M9M']= {--Kub
		['v_avrg'] = 550,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 28000,--15000->25000 изменено 14.10.2019 
		['CP']=0.14,
	},
	['SA48H6E2']= {--С300ПМУ, новая ЗУР, 48N6 S-300F, CGN 1144.2 Pyotr Velikiy
		['v_avrg'] = 1200,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 30000,--25000 уточнено 23.09.2019, экспертная оценка
		['CP']=3.0,--прим.$1.500.000
	},
	['SA5B27']= {--корабельный С-125 ПВО, SA-3 S-125
		['v_avrg'] = 1000,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 18000,
		['CP']=0.8,
	},
	['SA5B55']= {--С300ПС, старая ЗУР: ближняя-средняя, на воор., но сняты с производства, кр. Москва
		['v_avrg'] = 1200,
		['p_dstr'] = 0.6,
		['t_aim'] = 15,
		['d_max'] = 30000,--25000--20000 уточнено 23.09.2019, экспертная оценка
		['CP']=2.0,
	},
	['SA9M31']= {--СТрела1
		['v_avrg'] = 400,
		['p_dstr'] = 0.4,
		['t_aim'] = 10,
		['d_max'] = 3500,
		['CP']=0.08,
	},
	['SA9M311']= {--ЗУР Тунгуски
		['v_avrg'] = 450,
		['p_dstr'] = 0.5,
		['t_aim'] = 7,
		['d_max'] = 7000,--6000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.16,
	},
	['SA9M33']= {--Osa
		['v_avrg'] = 450,
		['p_dstr'] = 0.35,--0.55
		['t_aim'] = 42,--уточнено 23.09.2019, экспертная оценка
		['d_max'] = 12500,--6500 уточнено 23.09.2019, экспертная оценка
		['CP']=0.1,
	},
	['SA9M330']= {--Тор
		['v_avrg'] = 850,
		['p_dstr'] = 0.7,
		['t_aim']  = 5,
		['d_max'] = 15000,--10000уточнено 23.09.2019, экспертная оценка
		['CP']=0.4,
	},
	['SA9M333']= {--Стрела-10М3
		['v_avrg'] = 650,
		['p_dstr'] = 0.3,
		['t_aim'] = 8,
		['d_max'] = 4000,--5000уточнено 23.09.2019, экспертная оценка
		['CP']=0.14,
	},
	['SA9M38M1']= {--Buk SA-11 (Buk)	
	--Su-27, Alt 10000 m, speed 1000 km/h,  
	--head to head	47	44	29	27	
		['v_avrg'] = 2000,
		['p_dstr'] = 0.75,
		['t_aim']  = 10,
		['d_max'] = 25000,--30000 уточнено 23.09.2019, экспертная оценка
		['CP']=1.6,--одной ракеты (тест)
	},	
	
 	['SA9M82']= {--С300 -дальняя
		['v_avrg'] = 1200,
		['p_dstr'] = 0.75,
		['t_aim'] = 10,
		['d_max'] = 30000,--
		['CP']=2.4,
	},
	['SA9M83']= {--С300В
		['v_avrg'] = 2000,
		['p_dstr'] = 0.75,
		['t_aim']  = 10,
		['d_max'] = 30000,
		['CP']=3.0,--одной ракеты
	},
	['SAV611']= {--кораб ЗРК М-11 «Шторм», 55км      _________________________не используется
		['v_avrg'] = 800,
		['p_dstr'] = 0.6,
		['t_aim'] = 15,
		['d_max'] = 22000,
		['CP']=0.4,
	},
	['SCUD_RAKETA']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=13.86,--на 1958 г =800.000руб
	},
	['Sea_Eagle']= {--GB ПКР, 110км, Tornado GR4
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=2.0,--750.000 на 1992г
	},
	['SeaSparrow']= { -- CVN-74 Stennis
		['v_avrg'] = 450,
		['p_dstr'] = 0.6,
		['t_aim'] = 10,
		['d_max'] = 25000,--уточнено 23.09.2019, экспертная оценка
		['CP']=1.43,--было как за 715тыс: 1.43
	},
--	['Silkworm_SR']= {-- ПУ для ПКР SS-2 Silkworm, Рома нашел 13.09.2019 Китайская версия п15 термитт
--		['v_avrg'] = 0,
---		['p_dstr'] = 0,
--		['t_aim'] = 0,
--		['d_max'] = 0,
--		['CP']=0.40,
--	},
	['Super_530D']= {--франц. УР В-В, Mirage 2000-5
		['v_avrg'] = 550,
		['p_dstr'] = 0.55,
		['t_aim'] = 15,
		['d_max'] = 12000, -- дальность обстрела цели (h=2000м,v=500кмч)
		['CP']=1.430,
	},
	['SM_2']= {-- SM-2 (RIM-66 Standart для Тикандероги и Оливера Перри
		['v_avrg'] = 1200,
		['p_dstr'] = 0.8,
		['t_aim'] = 10,
		['d_max'] = 30000,
		['CP']=3.20,
	},
	['SVIR']= {--ПТУР Т-72
		['v_avrg'] = 280,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 3500,--4000 уточнено 23.09.2019, экспертная оценка
		['CP']=0.060,
	},
	['Torpedo']= {--ПЛ бомба-торпеда
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.40,
	},
	['TOW']= { -- воздушный TOW, AH-1W
		['v_avrg'] = 80,
		['p_dstr'] = 0.1,
		['t_aim'] = 10,
		['d_max'] = 2900,
		['CP']=0.180,
	},
	['TOW2']= {  -- ATGM HMMWV TOW
		['v_avrg'] = 80,
		['p_dstr'] = 0.1,
		['t_aim'] = 10,
		['d_max'] = 3700,
		['CP']=0.180,
	},
	['Vikhr']= { -- _________________________скорее высего не используется
		['v_avrg'] = 100,
		['p_dstr'] = 0.4,
		['t_aim'] = 15,
		['d_max'] = 6500,
		['CP']=0.20,--1.0
	},
	['Vikhr_M']= { 
		['v_avrg'] = 100,
		['p_dstr'] = 0.4,
		['t_aim'] = 15,
		['d_max'] = 6500,
		['CP']=0.20,
	},
	['X_15']= {--ПКР,280км, _____________________основная -ЯБЧ, не нашел кому можно повесить, могут Ту-22М3, Ту-160, ту-95МС6
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0,
	},
	['X_22']= {--ПКР,930кг, 600км, Ту-22М3
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.60,
	},
	['X_23']= {--ПРР? В-З, РК-навед., 111кг, 10км, __________________________не нашел кому можно повесить, может Су17М4
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.30,
	},
	['X_23L']= { --Су17М4
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.3,
	},
	['X_25ML']= { --Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.1,
	},
	['X_25MP']= { --Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.1,
	},
	['X_25MPU']= {--Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.14,
	},	
	['X_25MR']= { --Су-24М
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.14,
	},
	['X_28']= { --_________________________не нашел насителя (Су-24 может)
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.16,
	},
	['X_29L']= { -- Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.15,
	},
	['X_29T']= { -- Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.18,
	},
	['X_29TE']= { -- __________________________нет носителя (Может Су-24, 34, 25т ид)
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2,
	},
	['X_31A']= {--ПКР, Су24М
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.54,
	},
	['X_31P']= {--ПРР, Су24М
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.54,
	},
	['X_35']= { --Ту-142
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.5,--15 млн рублей
	},
	['X_41']= { --Moskit FSG 1241.1MP Molniya
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.5,
	},
	['X_55']= { -- _______________________________Х-55
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=3.0,
	},
	['X_58']= { --Х-58У, Су-25Т
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.5,
	},
	['X_59M']= { -- Су-34
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.54,
	},
	['X_65']= { -- Ту-95МС
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.6,
	},
	['YJ-83']= {-- ПКР Китая, используется кораблями, данные от Гарпуна Agm-88A добавлено 14.10.2019 Ромой, Type 052B Destroyer
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0--1.7,--500.000$ (примерно)
	},
	['YJ-62']= {-- ПКР Китая, используется кораблями, данные от Гарпуна Agm-88A, Type 052C Destroyer 
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=1.0--1.7,--500.000$ (примерно)
	},	

-----
}
Ammo_UNguided = {
	--1) НАР, бомбы
	['BDU_33']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.06,
	},	
	['BDU_50HD']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['BDU_50LD']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['BDU_50LGB']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['BetAB_250']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.01,
	},
	['BetAB_500']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.02,
	},
	['BetAB_500ShP']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.03,
	},
	['BL_755']= {--РБК
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.012,
	},

	['C_13']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['C_24']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.004,
	},
	['C_25']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.006,
	},
	['C_5']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.0004,
	},
	['C_8']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['C_8CM']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['C_8FP2']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['C_8OM']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['C_8OFP2']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['CBU_87'] = {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.06,
	},
	['CBU_97'] = {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.71,
	},
	['FAB_100']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},	
	['FAB_1500']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.006,
	},
	['FAB_250']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['FAB_250P']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.003,
	},
	['FAB_500']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.004,
	},
	['FAB_500_3']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.006,
	},
	['FAB_500P']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.006,
	},
	['HVAR']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.0003,
	},	
	['HYDRA_70']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M_117']= {--ядерная бомба для Ф86
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=4.0,
	},	
	['Mk_81']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Mk_82']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.0046,
	},
	['MK_82AIR']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.005,
	},
	['MK_82SNAKEYE']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.005,
	},
	['Mk_83']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.012,
	},
	['Mk_84']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.016,
	},
	['ODAB_500PM']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.004,
	},
	['RBK_250']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.012,
	},
	['RBK_250S']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.012,
	},
	['RBK_500AO']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.2,
	},
	['RBK_500SOAB']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.02,
	},
	['ROCKEYE']= {-- Mk20 свободнопадающая неуправляемая кассетная бомба
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.01,
	},	
	['SAB_100']= {--САБ
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['URAGAN_RAKETA']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.02,
	},	
	['XZAB_500']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.004,
	},
	['Z_BAK_3']= {
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['Zuni_127']= {--НАР
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	['Zuni_127CM']= {--НАР
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.002,
	},
	
	--2) теперь снаряды-пули, 93 единицы	
--для ВОЗДУШНОГО носителя P_destr/V0/дальность/вес снаряда:
--23=0.002/700/???-190г,30=0.005/800/???-400г, 37=0.01/600/???-750г- 
--20(M197)= 0.05/800/800-???г
--30(M230)=0.1/450/1400/???
--Для НАЗЕМНОГО носителя P_destr: 
--Тунгуска=0.15(до 3000м), Шилка=0.2 (до 1500м), 
--25-mm M242=0.01/600/1000/???, КПВТ=0.002
--12.7=0.001

	['2A18_122'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['2A28_73'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['2A33_152'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['2A38_30_AP'] = {	--2С6, пушка Тунгуски //P_destr: Тунгуска=0.15(до 3000м), Шилка=0.2 (до 1500м)
		['v_avrg'] = 800,
		['p_dstr'] = 0.150,--за цикл использования (обнаружение, прицеливание, стрельба одной 1-сек очередью)
		['t_aim'] = 7,
		['d_max'] = 3000,
		['CP']=0.0001,
	},
	['2A38_30_HE'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.150,
		['t_aim'] = 7,
		['d_max'] = 3000,
		['CP']=0.0001,
	},
	['2A42_30_AP'] = {	
		['v_avrg'] = 750,--V0=960
		['p_dstr'] = 0.02,
		['t_aim'] = 10,
		['d_max'] = 1200,--как для наземки, так и для Ка-50...т.к. нет корректного учета платформы-носителя
		['CP']=0.0001,
	},
	['2A42_30_HE'] = {	
		['v_avrg'] = 750,
		['p_dstr'] = 0.02,
		['t_aim'] = 10,
		['d_max'] = 1200,
		['CP']=0.0001,
	},
	['2A46M_125_AP'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['2A46M_125_HE'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['2A60_120'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['2A64_152'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['2A64_152'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['2A7_23_AP'] = {	--Шилка, ЗУ-23-2 P_destr: Тунгуска=0.15(до 3000м), Шилка=0.2 (до 1500м)
		['v_avrg'] = 700,
		['p_dstr'] = 0.2,
		['t_aim'] = 6,
		['d_max'] = 1500,--1500
		['CP']=0.0001,
	},
	['2A7_23_HE'] = {	--Шилка, ЗУ-23-2
		['v_avrg'] = 700,
		['p_dstr'] = 0.2,--0.2
		['t_aim'] = 6,
		['d_max'] = 1500,--1500
		['CP']=0.0001,
	},
	['5_45x39'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['5_56x45'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['50Browning_Ball_M2'] = {	--12.7 для пулеметов П-51
		['v_avrg'] = 500,
		['p_dstr'] = 0.1,--дополнил 23.09.2019
		['t_aim'] = 8,--отсюда: \CoreMods\WWII Units\P-51D\P-51D.lua
		['d_max'] = 800,
		['CP']=0.00001,
	},
	['50Browning_AP_M2'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.1,--дополнил 23.09.2019
		['t_aim'] = 8,
		['d_max'] = 800,
		['CP']=0.00001,
	},
	['50Browning_API_M8'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.1,--дополнил 23.09.2019
		['t_aim'] = 8,
		['d_max'] = 800,
		['CP']=0.00001,
	},
	['50Browning_APIT_M20'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.1,--дополнил 23.09.2019
		['t_aim'] = 8,
		['d_max'] = 800,
		['CP']=0.00001,
	},
	['7_62x39'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['7_62x51'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['7_62x54'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['7_62x54_NOTRACER'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['20x138B_AP'] = {	--20мм Пушка 4х ствольного флака, добавлено Ромой 14.10.2019
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 1500,
		['CP']=0.0001,
	},
	['20x138B_HE'] = {	--20мм Пушка 4х ствольного флака
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 1500,
		['CP']=0.0001,
	},
	['A222_130'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['AK100_100'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['AK176_76'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.0001,
	},
	['AK630_30_AP'] = {	--ГШ-6-30К - корабельная ПВО, будем считать, что имеется автомат.прицеливания
		['v_avrg'] = 800,--V0=1030
		['p_dstr'] = 0.2,
		['t_aim'] = 10,
		['d_max'] = 3000,
		['CP']=0.0001,
	},
	['AK630_30_HE'] = {	
		['v_avrg'] = 800,--V0=1030
		['p_dstr'] = 0.2,
		['t_aim'] = 10,
		['d_max'] = 3000,
		['CP']=0.0001,
	},
	['BK_27'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['Bofors_40mm_HE'] = {
		['v_avrg'] = 750,
		['p_dstr'] = 0.01,
		['t_aim'] = 10,
		['d_max'] = 1500,
		['CP']=0.001,
	},
	['Br303_tr'] = { -- пулемет десантного катера 7,62мм
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['Br303'] = { -- пулемет десантного катера 7,62мм
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_Ball_Mk1c'] = { -- пулеметы спитфаера
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_Ball_Mk6'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_Ball_Mk7'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_Ball_Mk8'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_G_Mk1'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_G_Mk2'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_G_Mk3'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_G_Mk4'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_G_Mk5'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_G_Mk6z'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_W_Mk1z'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_B_Mk4z'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_B_Mk6z'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['British303_O_Mk1'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['Hispano_Mk_II_20x80AP'] = {	--20мм Пушка спитфаера HispanoMkII
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['Hispano_Mk_II_20x80HET'] = {	--20мм Пушка спитфаера HispanoMkII
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['Hispano_Mk_II_20x80HE'] = {	--20мм Пушка спитфаера HispanoMkII
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['DANA_152'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['DEFA552_30'] = {	--Мираж 2000-5
		['v_avrg'] = 640,--V0=765-820
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 1200,
		['CP']=0.0001,
	},
	['Flak41_Sprgr_39'] = {	--88мм снаряд Флака
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,--0.005-> изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 5000, -- стреляет и дальше, но вероятность попадания крайне низкая
		['CP']=0.0001,
	},
	['Flak18_Sprgr_39'] = {	--88мм снаряд Флака
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,--0.005-> изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 5000, -- стреляет и дальше, но вероятность попадания крайне низкая
		['CP']=0.0001,
	},
	['GAU8_30_AP'] = {	--23=0.002/700-190г,30=0.005/800-400г, 37=0.01/600-750г
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,--0.005-> изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 1000, -- 400 увеличено, т.к. этой пушки стоит опасаться на большем расстоянии
		['CP']=0.0001,
	},
	['GAU8_30_HE'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['GAU8_30_TP'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['GSH23_23_AP'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.02,--0.002 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 700,
		['CP']=0.0001,
	},
	['GSH_23_AP'] = {--E:\DCS_ALL_Trunk\lockon\LockOnExe\CoreMods\aircraft\MiG-21bis\Entry\Aw (2 hits)Line 596: Line 689: 
		['v_avrg'] = 700,
		['p_dstr'] = 0.02,
		['t_aim'] = 5,
		['d_max'] = 700,
		['CP']=0.0001,
	},
	['GSH23_23_HE'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.02,
		['t_aim'] = 5,
		['d_max'] = 700, -- Л-39 хорошо попадает на 700 метрах
		['CP']=0.0001,
	},
	['GSH23_23_HE_T'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.02,
		['t_aim'] = 5,
		['d_max'] = 700,
		['CP']=0.0001,
	},
	['GSH301_30_AP'] = {	--23=0.002/700-190г,30=0.005/800-400г, 37=0.01/600-750г- для ВОЗДУШНОГО носителя
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,--0.05 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 1000,--400
		['CP']=0.0001,
	},
	['GSH301_30_HE'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,--0.05 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 1000,--400
		['CP']=0.0001,
	},
	['GSh_30_1'] = { -- Из отладчика, аналогично GSH301_30_HE
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,--0.05 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 1000,--400
		['CP']=0.0001,
	},
	['HEDPM430'] = {--по ходу стрелковое оружие..
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.0001,
	},
	['HESH_105'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['HP30_30_AP'] = {--может имели ввиду НР30 (NR)	
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,--0.005 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['HP30_30_HE'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,--0.005 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},					--23=0.002/700-190г,30=0.005/800-400г, 37=0.01/600-750г	--для ВОЗДУШНОГО носителя
	['KDA_35_AP'] = {	--Гепард однако
		['v_avrg'] = 800,
		['p_dstr'] = 0.15,--за цикл использования (обнаружение, прицеливание, стрельба одной 1-сек очередью)
		['t_aim'] = 6,
		['d_max'] = 2800,--как 0.7 от 4000
		['CP']=0.0001,
	},
	['KDA_35_FAPDS'] = {
		['v_avrg'] = 800,
		['p_dstr'] = 0.15,
		['t_aim'] = 6,
		['d_max'] = 2800,
		['CP']=0.0001,
	},
	['KDA_35_HE'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.15,
		['t_aim'] = 6,
		['d_max'] = 2800,
		['CP']=0.0001,
	},
	['53-UBR-281U'] = {	--ЗСУ-57, С-60
		['v_avrg'] = 800,
		['p_dstr'] = 0.15,--за цикл использования (обнаружение, прицеливание, стрельба одной 1-сек очередью)
		['t_aim'] = 6,
		['d_max'] = 3500,
		['CP']=0.0001,
	},
	['53-UOR-281U'] = {	--ЗСУ-57, С-60
		['v_avrg'] = 800,
		['p_dstr'] = 0.15,--за цикл использования (обнаружение, прицеливание, стрельба одной 1-сек очередью)
		['t_aim'] = 6,
		['d_max'] = 3500,
		['CP']=0.0001,
	},
	['KPVT_14_5_T'] = {	--P_destr:14.5мм=0.002//20мм=
		['v_avrg'] = 600,
		['p_dstr'] = 0.002,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['L14A2_30_APDS'] = {--30-мм пушка БМП Warrior	
		['v_avrg'] = 600,
		['p_dstr'] = 0.01,
		['t_aim'] = 10,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['L21A1_30_HE'] = {	--30-мм пушка БМП Warrior
		['v_avrg'] = 600,
		['p_dstr'] = 0.01,
		['t_aim'] = 10,
		['d_max'] = 1000,--дальность ниже, чем у М230, т..к нет автомат.расчета поправок
		['CP']=0.0001,
	},
	['M134_7_62_T'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['M185_155'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M197_20'] = {	--пушка 3-ствольная Кобры
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,--  лучше, чем обычные 23-мм авиа-пушки, т.к. поворотная
		['t_aim'] = 8,
		['d_max'] = 800,
		['CP']=0.0001,
	},
	['M2_12_7'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,--было 0.001 -> 23.09.2019 увеличено по рез.тестов
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['M2_12_7_T'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,--было 0.001 -> 23.09.2019 увеличено по рез.тестов
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['M2_50_aero_AP'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,--было 0.001 -> 23.09.2019 увеличено по рез.тестов
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['M20_50_aero_APIT'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,--было 0.001 -> 23.09.2019 увеличено по рез.тестов
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['M230_30'] = {	--пушка AH-64A/D
		['v_avrg'] = 450,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M242_25_AP_M791'] = {	--БМП M2
		['v_avrg'] = 600,
		['p_dstr'] = 0.01,
		['t_aim'] = 5,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['M242_25_AP_M919'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.01,
		['t_aim'] = 5,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['M242_25_HE_M792'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.01,
		['t_aim'] = 5,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['M256_120_AP'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M256_120_HE'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M383'] = {--40мм ГРАНАТОМЕТ Mk.19	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.0001,
	},
	['M39_20_API'] = {--авиапушка, одствольная	
		['v_avrg'] = 700,
		['p_dstr'] = 0.002,
		['t_aim'] = 7,
		['d_max'] = 600, --400 увеличено до 600, такие же пушки у F-5E3 
		['CP']=0.0001,
	},
	['M39_20_HEI'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.002,
		['t_aim'] = 7,
		['d_max'] = 600,
		['CP']=0.0001,
	},
	['M39_20_HEI_T'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.002,
		['t_aim'] = 7,
		['d_max'] = 600,
		['CP']=0.0001,
	},
	['M39_20_TP'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.002,
		['t_aim'] = 7,
		['d_max'] = 600,
		['CP']=0.0001,
	},
	['M39_20_TP_T'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.002,
		['t_aim'] = 7,
		['d_max'] = 600,
		['CP']=0.0001,
	},		
	['M61_20_AP'] = {	--к ЗСУ вулкан
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_HE'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_HE_INVIS'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_TP'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_TP_T'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_PGU28'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_PGU27'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},
	['M61_20_PGU30'] = {	
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 15,
		['d_max'] = 1400,
		['CP']=0.0001,
	},	
	['M68_105_AP'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M68_105_HE'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['MAUZER30_30'] = {	--думаю как для 25-mm M242
		['v_avrg'] = 650,
		['p_dstr'] = 0.01,
		['t_aim'] = 8,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['MG_13x64_APT'] = {	--13мм пулемет Bf-109K-4
		['v_avrg'] = 800,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['MG_13x64_API'] = {	--13мм пулемет Bf-109K-4
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['MG_13x64_HEI'] = {	--13мм пулемет Bf-109K-4
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['MG_20x82_HEI_T'] = {	--20мм Пушка FW-190
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['MG_20x82_API'] = {	--20мм Пушка FW-190
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['MG_20x82_MGsch'] = {	--20мм Пушка FW-190
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},	
	['Mk_12_HE_shell'] = {	--Пулемет 12,7 десантный транспорт LS Samuel Chase
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 500,
		['CP']=0.0001,	
	},
	['Mk_20_HE_shell'] = {	--20мм Пушка десантный транспорт LS Samuel Chase
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['MK45_127'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0,
	},
	['MK75_76'] = {	
		['v_avrg'] = 720,--V0=914..925 м/с
		['p_dstr'] = 0.001,--из-за низкой скорострельности
		['t_aim'] = 10,
		['d_max'] = 1000,
		['CP']=0.0001,
	},
	['MK_108_MGsch'] = {	--30мм Пушка Bf-109K-4
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['MK_108_MGsch_T'] = {	--30мм Пушка Bf-109K-4
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['MK_108_HEI'] = {	--30мм Пушка Bf-109K-4, данные как у А-10
		['v_avrg'] = 800,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},

	['NR23_23x115_API'] = {	--23=0.002/700-190г,30=0.005/800-400г, 37=0.01/600-750г
		['v_avrg'] = 700,
		['p_dstr'] = 0.02,--0.002 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['NR23_23x115_HEI_T'] = {	
		['v_avrg'] = 700,
		['p_dstr'] = 0.02,
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['N37_37x155_API_T'] = {	--23=0.002/700,30=0.005/800, 37=0.01/600
		['v_avrg'] = 600,
		['p_dstr'] = 0.025,--0.01 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['N37_37x155_HEI_T'] = {
		['v_avrg'] = 600,
		['p_dstr'] = 0.025,--0.01 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['NR30_30x155_APHE'] = {--23=0.002/700,30=0.005/800, 37=0.01/600
		['v_avrg'] = 800,
		['p_dstr'] = 0.025,
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['NR30_30x155_APT'] = {
		['v_avrg'] = 800,
		['p_dstr'] = 0.025,--0.005 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['NR30_30x155_HEI_T'] = {
		['v_avrg'] = 800,
		['p_dstr'] = 0.025,--0.005 изменил 23.09.2019
		['t_aim'] = 5,
		['d_max'] = 400,
		['CP']=0.0001,
	},
	['Oerlikon_20mm_HE'] = {	--20мм танкодесантного корабля LST_Mk2
		['v_avrg'] = 500,
		['p_dstr'] = 0.05,
		['t_aim'] = 5,
		['d_max'] = 1000,
		['CP']=0.0001,
	},	
	['PKT_7_62'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.0001,
		['t_aim'] = 5,
		['d_max'] = 200,
		['CP']=0.000001,
	},
	['PKT_7_62_T'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.0001,
		['t_aim'] = 5,
		['d_max'] = 200,
		['CP']=0.000001,
	},
	['Rh202_20_AP'] = {	--чуть хуже, чем 25-mm M242
		['v_avrg'] = 600,
		['p_dstr'] = 0.015,
		['t_aim'] = 10,
		['d_max'] = 800,
		['CP']=0.0001,
	},
	['Rh202_20_HE'] = {	
		['v_avrg'] = 600,
		['p_dstr'] = 0.015,
		['t_aim'] = 10,
		['d_max'] = 800,
		['CP']=0.0001,
	},
	['UOF_17_100HE'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['UOF_412_100HE'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Utes_12_7x108'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.001,
		['t_aim'] = 10,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['Utes_12_7x108_T'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.001,
		['t_aim'] = 10,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['VOG17'] = {	
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.00001,
	},
	['YakB_12_7'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.1,--0.05  изменил 23.09.2019
		['t_aim'] = 8,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['YakB_12_7_T'] = {	
		['v_avrg'] = 500,
		['p_dstr'] = 0.1,--0.05  изменил 23.09.2019
		['t_aim'] = 8,
		['d_max'] = 500,
		['CP']=0.00001,
	},
	['M51_37AP'] = { -- Пушка 37мм М8 Грейхаунд
		['v_avrg'] = 600,
		['p_dstr'] = 0.025,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['M63_37HE'] = { -- Пушка 37мм М8 Грейхаунд
		['v_avrg'] = 600,
		['p_dstr'] = 0.025,
		['t_aim'] = 5,
		['d_max'] = 500,
		['CP']=0.0001,
	},
	['ZTZ_125_AP'] = { -- Пушка ZTZ 96B
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},	
	['7_92x57sS'] = { -- пулемет WW2 sd251
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 400,
		['CP']=0.00001,
	},
	['7_92x57_Smkl'] = { -- пулемет WW2 sd251
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 400,
		['CP']=0.00001,
	},
	['Besa7_92x57T'] = { -- пулемет WW2 Cromwell IV
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 400,
		['CP']=0.00001,
	},
	['Besa7_92x57'] = { -- пулемет WW2 Cromwell IV
		['v_avrg'] = 600,
		['p_dstr'] = 0.1,
		['t_aim'] = 4,
		['d_max'] = 400,
		['CP']=0.00001,
	},
	['Pzgr_39_5cm'] = { -- Пушка 50мм sd234/2 Puma
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Sprgr_38'] = { --  50мм sd234/2 Puma
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M61'] = { --  75mm AP Cromwell IV
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M46'] = { --  75mm HE Cromwell IV
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Pzgr_39/40'] = { --  75mm AP Stug III
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Sprgr_34_L48'] = { --  75mm HE Stug III
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M62_APC'] = { --  76mm AP M10 GMC
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['M42A1_HE'] = { --  76mm HE M10 GMC
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},	
	['Pzgr_39/43'] = { --  88mm AP JgPz G1
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Sprgr_43_L71'] = { --  88mm HE JgPz G1
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['QF95_206R_fixed'] = { --  95mm HE Centaur IV
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['APCBC'] = { --  76mm AP M4A4 Sherman FF
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['QF17_HE'] = { --  76mm HE M4A4 Sherman FF
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Pzgr_39/42'] = { --  75mm AP Pz V Panther,
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['Sprgr_34_L70'] = { --  75mm HE Pz V Panther
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},	
	['Pzgr_39'] = { --  88mm AP pz VI Tiger_I
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},	
	['Sprgr_39'] = { --  88mm HE pz VI Tiger_I
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	['I_Gr_33'] = { --  15сm HE SturmPzIV
		['v_avrg'] = 0,
		['p_dstr'] = 0,
		['t_aim'] = 0,
		['d_max'] = 0,
		['CP']=0.001,
	},
	
-----
}
Units_Aircraft_Modern = {--the value will then be multiplied by K_Aircraft_Modern = 25.0

	['A-10A'] = {	--как Су-25
		['CP'] = 0.82,
	},
	['A-10C'] = {	--
		['CP'] = 1.303,
	},
	['A-50'] = {	--
		['CP'] = 6.5,
	},
	['AJS37'] = {	--как F-16C
		['CP'] = 2.299,
	},
	['An-26B'] = {	--как МИ-8
		['CP'] = 0.651,
	},
	['An-30M'] = {	--
		['CP'] = 0.651,
	},
	['AV8BNA'] = {	--как А-10С
		['CP'] = 1.303,
	},
	['B-1B'] = {	--как А-50
		['CP'] = 6.5,
	},
	['B-52H'] = {	--самолет
		['CP'] = 3.5,
	},
	['C-101CC'] = {	--как D9
		['CP'] = 0.405,
	},
	['C-101EB'] = {	--
		['CP'] = 0.405,
	},
	['C-130'] = {	--
		['CP'] = 1.211,
	},
	['C-17A'] = {	--самолет
		['CP'] = 4.798,--уточнено 23.09.2019, т.к.77519/7257 (А-10С)
	},
	['E-2C'] = {	--как С-130
		['CP'] = 1.196,
	},
	['E-3A'] = {	--как А-50
		['CP'] = 6.5,
	},
	['F/A-18A'] = {	--как F-16C
		['CP'] = 2.29,
	},
	['F/A-18C'] = {	--самолет
		['CP'] = 2.708,
	},
	['F-117A'] = {	--как A-10C
		['CP'] = 1.303,
	},
	['F-14A'] = {	--как F-18A
		['CP'] = 2.29 ,
	},
	['F-15C'] = {	--самолет
		['CP'] = 2.3,--2.0, 2.3=as F-16C
	},
	['F-15E'] = {	--как F-18C
		['CP'] = 2.7,
	},
	['F-16A'] = {	--чуть болльше чем как A-10C
		['CP'] = 1.5,
	},
	['F-16A MLU'] = {	--
		['CP'] = 1.5,
	},
	['F-16C bl.50'] = {	--
		['CP'] = 2.299,
	},
	['F-16C bl.52d'] = {	--
		['CP'] = 2.299,
	},
	['F-16C_50'] = {	--
		['CP'] = 2.299,
	},
	['F-4E'] = {	--как А-10А
		['CP'] = 0.82,
	},
	['F-5E'] = {	--хуже, чем Су-25
		['CP'] = 0.7,
	},
	['F-5E-3'] = {	--
		['CP'] = 0.7,
	},
	['F-86F Sabre'] = {	--
		['CP'] = 0.455,
	},
	['FA-18C_hornet'] = {	--повтор с другим именем
		['CP'] = 2.708,
	},
	['Hawk'] = {	--как С-101
		['CP'] = 0.405,
	},
	['IL-76MD'] = {	--
		['CP'] = 3.188,--уточнено 23.09.2019, т.к.60000/7257 (А-10С)
	},
	['IL-78M'] = {	--самолет
		['CP'] = 2.8,
	},
	['J-11A'] = {	--как Су-27
		['CP'] = 1.81,
	},
	['KC130'] = {	--самолет
		['CP'] = 1.211,
	},
	['KC-135'] = {	--как Ил-76
		['CP'] = 2.735,
	},
	['KC135MPRS'] = {	--самолет
		['CP'] = 2.735,
	},
	['KJ-2000'] = {	--как А-50
		['CP'] = 6.5,
	},
	['L-39C'] = {	--самолет
		['CP'] = 0.405,
	},
	['L-39ZA'] = {	--чуть лучше D-9
		['CP'] = 0.505,
	},
	['M-2000C'] = {	--как су-27
		['CP'] = 1.81,
	},
	['MiG-15bis'] = {	--как F-86F
		['CP'] = 0.455,
	},
	['MiG-21Bis'] = {	--как F-5E
		['CP'] = 0.7,
	},
	['MiG-23MLD'] = {	--как Су-25
		['CP'] = 0.812,
	},
	['MiG-25PD'] = {	--как F-15C
		['CP'] = 2.3,
	},
	['MiG-25RBT'] = {	--
		['CP'] = 2.3,
	},
	['MiG-27K'] = {	--как Су-25
		['CP'] = 0.812,
	},
	['MiG-29A'] = {	--
		['CP'] = 1.5,--Су-27=1.8
	},
	['MiG-29C'] = {	--самолет
		['CP'] = 1.6,
	},	
	['MiG-29G'] = {	--самолет
		['CP'] = 1.6,
	},
	['MiG-29S'] = {	--самолет
		['CP'] = 1.6,
	},
	['MiG-31'] = {	--чуть больше МиГ-25
		['CP'] = 2.5,
	},
	['Mirage 2000-5'] = {	--см.выше
		['CP'] = 1.81,
	},
	['S-3B'] = {	--чуть лучше D-9
		['CP'] = 0.405,
	},
	['S-3B Tanker'] = {	--самолет
		['CP'] = 0.5,
	},
	['Su-17M4'] = {	--чуть больше чем как Су-25
		['CP'] = 0.9,
	},
	['Su-24M'] = {	--как F-16A
		['CP'] = 1.5,
	},
	['Su-24MR'] = {	--самолет
		['CP'] = 1.5,
	},
	['Su-25'] = {	--
		['CP'] = 0.812,
	},
	['Su-25T'] = {	--
		['CP'] = 1.1,
	},
	['Su-25TM'] = {	--
		['CP'] = 1.1,
	},
	['Su-27'] = {	--
		['CP'] = 1.810,--F-16C=2.29
	},
	['Su-30'] = {	--
		['CP'] = 2.0,
	},
	['Su-33'] = {	--как F-18A
		['CP'] = 2.29,
	},
	['Su-34'] = {	--как F-18C
		['CP'] = 2.7,
	},
	['Tornado GR4'] = {	--как F-16A
		['CP'] = 1.5,
	},
	['Tornado IDS'] = {	--самолет
		['CP'] = 1.5,
	},
	['Tu-142'] = {	--как B-52
		['CP'] = 3.5,
	},
	['Tu-160'] = {	--как B-1B
		['CP'] = 6.5,
	},
	['Tu-22M3'] = {	--между B-52 и F-18C
		['CP'] = 3.0,
	},
	['Tu-95MS'] = {	--самолет
		['CP'] = 3.5,
	},
	['Yak-40'] = {	--самолет
		['CP'] = 0.1,
	},
--БПЛА, пока в разделе совр.самолетов		
	['MQ-9 Reaper'] = {		--как D-9
		['CP'] = 0.405,
	},
	['Predator GCS'] = {	--БПЛА
		['CP'] = 0.405,
	},
	['Predator TrojanSpirit'] = {	--БПЛА
		['CP'] = 0.405,
	},
	['RQ-1A Predator'] = {	--БПЛА
		['CP'] = 0.405,
	},

}
Units_Aircraft_WWII = {

	['B-17G'] = {	--см.рейтинг Чижа
		['CP'] = 2.16,
	},
	['MosquitoFBMkVI'] = {	-- Требует уточнения
		['CP'] = 0.0,
	},
	['Bf-109K-4'] = {	--как D-9
		['CP'] = 0.27,
	},
	['Christen Eagle II'] = {	--самолет ВМВ
		['CP'] = 0.027,
	},
	['FW-190A8'] = {	--самолет ВМВ
		['CP'] = 0.324,
	},
	['FW-190D9'] = {	--самолет ВМВ
		['CP'] = 0.405,
	},
	['I-16'] = {	--самолет ВМВ
		['CP'] = 0.135,
	},
	['P-47D-30'] = {	--самолет ВМВ
		['CP'] = 0.405,
	},	
	['P-51D'] = {	--самолет ВМВ
		['CP'] = 0.405,
	},
	['P-51D-30-NA'] = {	--самолет ВМВ
		['CP'] = 0.405,
	},
	['SpitfireLFMkIX'] = {	--самолет ВМВ
		['CP'] = 0.27,
	},
	['SpitfireLFMkIXCW'] = {	--самолет ВМВ
		['CP'] = 0.27,
	},
	['TF-51'] = {	--самолет ВМВ
		['CP'] = 0.054,
	},
	['Yak-52'] = {	--самолет
		['CP'] = 0.027,
	},

}
Units_Helicopters = {

	['AH-1W'] = {	--вертолет
		['CP'] = 0.737,
	},
	['AH-64A'] = {	--вертолет
		['CP'] = 0.871,
	},
	['AH-64D'] = {	--вертолет
		['CP'] = 1.206,
	},
	['CH-47D'] = {	--вертолет
		['CP'] = 0.871,
	},
	['CH-53E'] = {	--вертолет
		['CP'] = 0.737,
	},
	['Ka-27'] = {	--вертолет
		['CP'] = 0.5695,
	},
	['Ka-50'] = {	--вертолет
		['CP'] = 1.005,--1.05х25=26.25
	},
	['Mi-24P'] = {	--вертолет
		['CP'] = 0.737,--Mi-35M стоил 15млн$ в 2014г 24	Mi-35M	Combat helicopter	2010	2011-2014	(24)	$360 m deal;
					--Mi-35M version (possibly second-hand Mi-24 rebuilt to Mi-35M)
	},
	['Mi-24V'] = {	--вертолет
		['CP'] = 0.67,
	},
	['Mi-26'] = {	--вертолет
		['CP'] = 1.474,
	},
	['Mi-28N'] = {	--вертолет
		['CP'] = 1.206,
	},
	['Mi-8MT'] = {	--вертолет
		['CP'] =0.6510 ,--16--0.6510
	},
	['OH-58D'] = {	--вертолет
		['CP'] = 0.335,
	},
	['SA342L'] = {	--вертолет
		['CP'] = 0.536,
	},
	['SA342M'] = {	--вертолет
		['CP'] = 0.536,
	},
	['SA342Minigun'] = {	--вертолет
		['CP'] = 0.536,
	},
	['SA342Mistral'] = {	--вертолет
		['CP'] = 0.536,
	},
	['SH-60B'] = {	--вертолет
		['CP'] = 0.5695,
	},
	['UH-1H'] = {	--вертолет
		['CP'] = 0.469,
	},
	['UH-60A'] = {	--вертолет
		['CP'] = 0.5695,
	},


	
}
Units_Ground_Armor = {--102 объекта

	['AAV7'] = {	--БТ
		['CP'] = 0.667,
	},
	['ATMZ-5'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['ATZ-10'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['Bedford_MWD'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Blitz_36-6700A'] = {	--автомобиль ВМВ
		['CP'] = 0.062,
	},
	['BMD-1'] = {	--БТ
		['CP'] = 0.492,
	},
	['BMP-1'] = {	--БТ
		['CP'] = 0.492,
	},
	['BMP-2'] = {	--БТ
		['CP'] = 0.667,
	},
	['BMP-3'] = {	--БТ
		['CP'] = 0.923,
	},
	['Boman'] = {	--неизвестно
		['CP'] = 0.215,
	},
	['BRDM-2'] = {	--БТ
		['CP'] = 0.369,
	},
	['BTR_D'] = {	--БТ
		['CP'] = 0.431,
	},
	['BTR-80'] = {	--БТ
		['CP'] = 0.431,--как БМП-1
	},
	['CCKW_353'] = {	--автомобиль ВМВ
		['CP'] = 0.092,
	},
	['Centaur_IV'] = {	--БТ ВМВ
		['CP'] = 0.369,
	},
	['Challenger2'] = {	--БТ
		['CP'] = 1.662,
	},
	['Cobra'] = {	--автомобиль
		['CP'] = 0.339,
	},
	['Cromwell_IV'] = {	--БТ ВМВ
		['CP'] = 0.369,
	},
	['Elefant_SdKfz_184'] = {	--БТ ВМВ
		['CP'] = 0.492,
	},
	['fire_control'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['GAZ-3307'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['GAZ-3308'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['GAZ-66'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['HEMTT TFFT'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Horch_901_typ_40_kfz_21'] = {	--автомобиль ВМВ
		['CP'] = 0.062,
	},
	['Hummer'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['IKARUS Bus'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Infantry AK'] = {	--ЖС
		['CP'] = 0.031,
	},
	['Infantry AK Ins'] = {	--ЖС
		['CP'] = 0.031,
	},
	['Jagdpanther_G1'] = {	--ВВ2
		['CP'] = 0.400,
	},
	['JagdPz_IV'] = {	--ВВ2
		['CP'] = 0.369,
	},	
	['KAMAZ Truck'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['KrAZ6322'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['Land_Rover_101_FC'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Land_Rover_109_S3'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['LAV-25'] = {	--БТ
		['CP'] = 0.554,
	},
	['LAZ Bus'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Leclerc'] = {	--БТ
		['CP'] = 1.662,
	},
	['Leopard1A3'] = {	--БТ
		['CP'] = 0.616,
	},
	['Leopard-2'] = {	--БТ
		['CP'] = 1.600,
	},
	['M 818'] = {	--автомобиль
		['CP'] = 0.308,--как Хамер
	},
	['M-1 Abrams'] = {	--БТ
		['CP'] = 1.6,
	},
	['M10_GMC'] = {	--автомобиль
		['CP'] = 0.339,
	},
	['M1025 HMMWV'] = {	--автомобиль Хаммер
		['CP'] = 0.062,--0.5х7=3.5
	},
	['M1043 HMMWV Armament'] = {	--БТ
		['CP'] = 0.185,
	},
	['M1045 HMMWV TOW'] = {	--БТ
		['CP'] = 0.277,
	},
	['M1126 Stryker ICV'] = {	--БТ
		['CP'] = 0.492,
	},
	['M1128 Stryker MGS'] = {	--БТ
		['CP'] = 0.862,
	},
	['M-113'] = {	--БТ
		['CP'] = 0.308,
	},
--	['M1134 Stryker ATGM'] = {	--перенесен в артиллерию
--		['CP'] = 0.862,
--	},	
	['M-2 Bradley'] = {	--БТ
		['CP'] = 0.965,
	},
	['M2A1_halftrack'] = {	--БТ
		['CP'] = 0.246,
	},
	['M30_CC'] = {	--автомобиль ВМВ
		['CP'] = 0.062,
	},
	['M4_Sherman'] = {	--БТ ВМВ
		['CP'] = 0.339,
	},
	['M4A4_Sherman_FF'] = {	--БТ ВМВ
		['CP'] = 0.400,
	},
	['M-60'] = {	--БТ
		['CP'] = 0.431,
	},
	['M978 HEMTT Tanker'] = {	--БТ
		['CP'] = 0.308,
	},
	['Marder'] = {	--БТ
		['CP'] = 0.431,
	},
	['MAZ-6303'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['MCV-80'] = {	--БТ
		['CP'] = 0.492,
	},
	['Merkava_Mk4'] = {	--БТ
		['CP'] = 1.662,
	},
	['MTLB'] = {	--БТ
		['CP'] = 0.369,
	},
	['Paratrooper AKS-74'] = {		--ЖС
		['CP'] = 0.031,
	},
	['Paratrooper RPG-16'] = {	--ЖС
		['CP'] = 0.031,
	},
	['Pz_IV_H'] = {	--БТ ВМВ
		['CP'] = 0.339,
	},
	['Pz_V_Panther_G'] = {	--БТ ВМВ
		['CP'] = 0.431,
	},	
	['Sd_Kfz_2'] = {	--автомобиль
		['CP'] = 0.092,--мотоприцеп
	},
	['Sd_Kfz_234_2_Puma'] = {	--автомобиль
		['CP'] = 0.308,--
	},
	['SKP-11'] = {	--автомобиль
		['CP'] = 0.123,
	},
	['Soldier AK'] = {	--ЖС
		['CP'] = 0.062,
	},
	['Soldier M249'] = {	--ЖС
		['CP'] = 0.062,
	},
	['Soldier M4'] = {	--ЖС
		['CP'] = 0.062,
	},
	['Soldier M4 GRG'] = {	--ЖС
		['CP'] = 0.062,
	},
	['Soldier RPG'] = {	--ЖС
		['CP'] = 0.062,
	},
	['soldier_mauser98'] = {	--ЖС
		['CP'] = 0.062,
	},
	['Stug_IV'] = {	--БТ
		['CP'] = 0.369,
	},
	['SturmPzIV'] = {	--БТ
		['CP'] = 0.308,
	},
	['T-55'] = {	--БТ
		['CP'] = 0.616,
	},
	['T-72B'] = {	--БТ
		['CP'] = 1.231,--1.9
	},
	['T-80UD'] = {	--БТ
		['CP'] = 1.323,
	},
	['T-90'] = {	--БТ
		['CP'] = 1.477,
	},
	['Tankcartrinity'] = {	--автомобиль
		['CP'] = 0.031,
	},
	['Tiger_I'] = {	--
		['CP'] = 0.431,
	},
	['Tiger_II_H'] = {	--
		['CP'] = 0.492,
	},
	['Tigr_233036'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['TPZ'] = {	--БТ
		['CP'] = 0.400,
	},
	['Trolley bus'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['UAZ-469'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Ural ATsP-6'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Ural-375'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['Ural-375 PBU'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['Ural-4320 APA-5D'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Ural-4320-31'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['Ural-4320T'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['VAZ Car'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['Willys_MB'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['ZiL-131 APA-80'] = {	--автомобиль
		['CP'] = 0.062,
	},
	['ZIL-131 KUNG'] = {	--автомобиль
		['CP'] = 0.308,
	},
	['ZIL-4331'] = {	--автомобиль
		['CP'] = 0.062,
	},
	
}
Units_Ground_AirDefense = {--66 объектов

	['1c91'] = {	--,--это сост.часть ЗРК Куб, СУРН "1С91", СР Тунгуски=18,218
		['CP'] = 2.85,
	},
	['1L13 EWR'] = {	--РЛС
		['CP'] = 1.82,
	},
	['2S6 Tunguska'] = {	--А может и так: ["SA-19 Tunguska 2S6"]
		['CP'] = 2.281,
	},
	['55G6 EWR'] = {	--РЛС
		['CP'] = 1.82,
	},
	['5p73 s-125 ln'] = {	--Система ПВО
		['CP'] = 1.6,
	},
	['bofors40'] = {	--ЗУ
		['CP'] = 0.57,
	},
	['Dog Ear radar'] = {	--РЛС
		['CP'] = 1.14,
	},
	['flak18'] = {	--ЗУ
		['CP'] = 0.8,
	},
	['flak30'] = {	--ЗУ
		['CP'] = 0.57,
	},
	['flak36'] = {	--ЗУ
		['CP'] = 0.8,
	},
	['flak37'] = {	--ЗУ
		['CP'] = 0.8,
	},	
	['Gepard'] = {	--Система ПВО
		['CP'] = 1.6,
	},
	['Hawk cwar'] = {	--Система ПВО
		['CP'] = 2.32,
	},
	['Hawk ln'] = {	--Система ПВО
		['CP'] = 0.95,
	},
	['Hawk pcp'] = {	--Система ПВО
		['CP'] = 4.22,
	},
	['Hawk sr'] = {	--Система ПВО
		['CP'] = 3.27,
	},
	['Hawk tr'] = {	--Система ПВО
		['CP'] = 3.37,
	},
	['Igla manpad INS'] = {	--Система ПВО
		['CP'] = 1.4,--
	},
	['Kub 1S91 str'] = {	--Система ПВО
		['CP'] = 1.45,
	},
	['Kub 2P25 ln'] = {	--Система ПВО
		['CP'] = 0.83,
	},
	['M1097 Avenger'] = {	--Система ПВО
		['CP'] = 1.85,--2.282х12=27.384
	},
	['M48 Chaparral'] = {	--Система ПВО
		['CP'] = 1.64,--1.5х12=18
	},
	['M6 Linebacker'] = {	--Система ПВО
		['CP'] = 2.17,--х12=21.6
	},
	['Osa 9A33 ln'] = {	--Система ПВО
		['CP'] = 2.05,
	},
	['p-19 s-125 sr'] = {	--Система ПВО
		['CP'] = 1.6,
	},
	['Patriot AMG'] = {	--Система ПВО
		['CP'] = 1.36,--part от 23.511
	},
	['Patriot cp'] = {	--Система ПВО
		['CP'] = 1.48,--part от 23.511
	},
	['Patriot ECS'] = {	--Система ПВО
		['CP'] = 8.09,--part от 23.511
	},
	['Patriot EPP'] = {	--Система ПВО
		['CP'] = 1.85,--part от 23.511
	},
	['Patriot ln'] = {	--Система ПВО
		['CP'] = 1.71,--part от 23.511
	},
	['Patriot str'] = {	--Система ПВО
		['CP'] = 9.02,--part от 23.511
	},
	['rapier_fsa_blindfire_radar'] = {	-- Система ПВО
		['CP'] = 1.06,
	},
	['rapier_fsa_launcher'] = {	-- Система ПВО
		['CP'] = 0.38,
	},
	['rapier_fsa_optical_tracker_unit'] = {	-- Система ПВО
		['CP'] = 0.84,
	},
	['Roland ADS'] = {	--Система ПВО
		['CP'] = 1.12,
	},
	['Roland Radar'] = {	--Система ПВО
		['CP'] = 1.16,
	},
	['S_75M_Volhov'] = {	--Система ПВО
		['CP'] = 1.6,
	},
	['S-300PS 40B6M tr'] = {	--Система ПВО
		['CP'] = 5.25,--part of 24.241
		--универсальная вышка с многофункциональной РЛС подсвета и наведения ракет
	},
	['S-300PS 40B6MD sr'] = {	--Система ПВО
		['CP'] = 5.07,--двухсекционная 39-метровая вышка 40В6МД 
		--с дополнительной съемной секцией дплиной 13 м,
		--может цепляться как НВО так и РЛ подсвета и наведения
	},
	['S-300PS 54K6 cp'] = {	--Система ПВО
		['CP'] = 5.79,--пункт боевого управления комплекса 
	},
	['S-300PS 5P85C ln'] = {	--Система ПВО
		['CP'] = 1.55,--пусковая установка
	},
	['S-300PS 5P85D ln'] = {	--Система ПВО
		['CP'] = 1.25,--пусковая установка
	},	
	['S-300PS 64H6E sr'] = {	--Система ПВО
		['CP'] = 5.33,--радиолокатор обзора
	},
	['SA-11 Buk CC 9S470M1'] = {	--Система ПВО
		['CP'] = 6.47,--16.9 батарея
	},
	['SA-11 Buk LN 9A310M1'] = {	--Система ПВО
		['CP'] = 4.07,
	},
	['SA-11 Buk SR 9S18M1'] = {	--Система ПВО
		['CP'] = 6.4,
	},
	['SA-18 Igla comm'] = {	--Система ПВО
		['CP'] = 0.17,
	},
	['SA-18 Igla manpad'] = {	--Система ПВО
		['CP'] = 1.4,
	},
	['SA-18 Igla-S comm'] = {	--Система ПВО
		['CP'] = 0.17,
	},
	['SA-18 Igla-S manpad'] = {	--Система ПВО
		['CP'] = 1.4,
	},
	['snr s-125 tr'] = {	--Система ПВО
		['CP'] = 2.62,
	},
	['SNR_75V'] = {	--Система ПВО
		['CP'] = 2.62,
	},
	['Soldier stinger'] = {	--Система ПВО
		['CP'] = 1.4,--
	},
	['Stinger comm'] = {	--Система ПВО
		['CP'] = 0.17,--
	},
	['Stinger comm dsr'] = {	--Система ПВО
		['CP'] = 0.17,
	},
	['Strela-1 9P31'] = {	--Система ПВО
		['CP'] = 0.91,
	},
	['Strela-10M3'] = {	--Система ПВО
		['CP'] = 1.77,--как Чапарэл
	},
	['Tor 9A331'] = {	--Тор
		['CP'] = 6.035,--
	},
	['Ural-375 ZU-23'] = {	--Система ПВО
		['CP'] = 0.684,
	},
	['Ural-375 ZU-23 Insurgent'] = {	--Система ПВО
		['CP'] = 0.684,
	},
	['Vulcan'] = {	--Система ПВО
		['CP'] = 0.934,-- 
	},
	['ZSU-23-4 Shilka'] = {	--Система ПВО
		['CP'] = 1.18 ,--
	},
	['ZU-23 Closed Insurgent'] = {	--Система ПВО
		['CP'] = 0.46,
	},
	['ZU-23 Emplacement'] = {	--Система ПВО
		['CP'] = 0.46,
	},
	['ZU-23 Emplacement Closed'] = {	--Система ПВО
		['CP'] = 0.46,
	},
	['ZU-23 Insurgent'] = {	--Система ПВО
		['CP'] = 0.46,
	},
	
}
Units_Ground_Artillery = {--19

	['2B11 mortar'] = {	--артиллерия
		['CP'] = 0.369,
	},
	['2S3 Akatsia'] = {
 		['CP'] = 0.985,--M109A6=13,389
	},
	['Grad-URAL'] = {	--артиллерия
		['CP'] = 1.6,
	},
	['hy_launcher'] = {	--ПУ 
		['CP'] = 0.739,
	},
	['M-109'] = {	--артиллерия
		['CP'] = 1.231,
	},
	['M1134 Stryker ATGM'] = {	--БТ
		['CP'] = 0.862,
	},	
	['M12_GMC'] = {	--арт
		['CP'] = 1.354,
	},
	['MLRS'] = {	--артиллерия
		['CP'] = 1.847,
	},
	['MLRS FDDM'] = {	--артиллерия
		['CP'] = 0.492,
	},
	['SAU 2-C9'] = {	--артиллерия
		['CP'] = 0.739,
	},
	['SAU Akatsia'] = {	--артиллерия
		['CP'] = 0.985,
	},
	['SAU Gvozdika'] = {	--артиллерия
		['CP'] = 0.862,
	},
	['SAU Msta'] = {	--артиллерия
		['CP'] = 1.477,
	},
	['ScudLauncher'] = {	--артиллерия
		['CP'] = 1.847,
	},
	['Silkworm_SR'] = {	--Радар для ПКР
		['CP'] = 0.985,
	},	
	['SK_C_28_naval_gun'] = {	--артиллерия
		['CP'] = 0.739,
	},
	['Smerch'] = {	--артиллерия
		['CP'] = 2.462,
	},
	['SpGH_Dana'] = {	--артиллерия
		['CP'] = 1.108,	--152мм
	},
	['TomahawkLauncher'] = {	--артиллерия
		['CP'] = 1.723,
	},
	['Uragan_BM-27'] = {	--артиллерия
		['CP'] = 1.908,
	},

}
Units_Construction = {
	['Barracks 2'] = {	--постройка
		['CP'] = 0.4,
	},
	['Boiler-house A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Boxcartrinity'] = {	--жд
		['CP'] = 0.4,
	},
	['Cafe'] = {	--постройка
		['CP'] = 0.4,
	},
	['Chemical tank A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Coach a passenger'] = {	--жд
		['CP'] = 0.4,
	},
	['Coach a platform'] = {	--жд
		['CP'] = 0.4,
	},
	['Coach a tank blue'] = {	--жд
		['CP'] = 0.4,
	},
	['Coach a tank yellow'] = {	--жд
		['CP'] = 0.4,
	},
	['Coach cargo'] = {	--жд
		['CP'] = 0.4,
	},
	['Coach cargo open'] = {	--жд
		['CP'] = 0.4,
	},
	['Comms tower M'] = {	--постройка
		['CP'] = 0.4,
	},
	['Container brown'] = {	--контейнер
		['CP'] = 0.4,
	},
	['Container red 1'] = {	--контейнер
		['CP'] = 0.4,
	},
	['Container red 2'] = {	--контейнер
		['CP'] = 0.4,
	},
	['Container red 3'] = {	--контейнер
		['CP'] = 0.4,
	},
	['Container white'] = {	--контейнер
		['CP'] = 0.4,
	},
	['DR_50Ton_Flat_Wagon'] = {	--ЖД
		['CP'] = 0.4,
	},
	['DRG_Class_86'] = {	--ЖД
		['CP'] = 0.4,
	},
	['Electric locomotive'] = {	--ЖД
		['CP'] = 0.4,
	},
	['Electric power box'] = {	--постройка
		['CP'] = 0.4,
	},
	['ES44AH'] = {	--ЖД
		['CP'] = 0.4,
	},
	['Farm A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Farm B'] = {	--постройка
		['CP'] = 0.4,
	},
	['FARP Ammo Dump Coating'] = {	--постройка авиа
		['CP'] = 0.8,
	},
	['FARP CP Blindage'] = {	--постройка авиа
		['CP'] = 0.8,
	},
	['FARP Fuel Depot'] = {	--постройка авиа
		['CP'] = 0.8,
	},
	['FARP Tent'] = {	--постройка авиа
		['CP'] = 0.8,
	},
	['Fuel tank'] = {	--объект
		['CP'] = 0.4,
	},
	['Garage A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Garage B'] = {	--постройка
		['CP'] = 0.4,
	},
	['Garage small A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Garage small B'] = {	--постройка
		['CP'] = 0.4,
	},
	['GeneratorF'] = {	--объект
		['CP'] = 0.4,
	},
	['German_covered_wagon_G10'] = {	--ЖД
		['CP'] = 0.4,
	},
	['German_tank_wagon'] = {	--ЖД
		['CP'] = 0.4,
	},
	['Hangar A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Hangar B'] = {	--постройка
		['CP'] = 0.4,
	},
	['Landmine'] = {	--объект
		['CP'] = 0.4,
	},
	['Locomotive'] = {	--ЖД
		['CP'] = 0.4,
	},
	['Military staff'] = {	--постройка
		['CP'] = 2.0,
	},
	['Oil derrick'] = {	--постройка
		['CP'] = 0.4,
	},
	['Oil platform'] = {	--постройка
		['CP'] = 0.4,
	},
	['Pump station'] = {	--объект
		['CP'] = 0.4,
	},
	['Railway crossing A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Railway crossing B'] = {	--постройка
		['CP'] = 0.4,
	},
	['Railway station'] = {	--постройка
		['CP'] = 0.4,
	},
	['Red_Flag'] = {	--объект
		['CP'] = 0.4,
	},
	['Repair workshop'] = {	--постройка
		['CP'] = 0.4,
	},
	['Restaurant 1'] = {	--постройка
		['CP'] = 0.4,
	},
	['Shelter B'] = {	--объект
		['CP'] = 0.4,
	},
	['Shelter'] = {	--объект
		['CP'] = 0.4,
	},
	['Shop'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small house 1A area'] = {	--пострйка
		['CP'] = 0.4,
	},
	['Small house 1A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small house 1B area'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small house 1B'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small house 1C area'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small house 2C'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small werehouse 1'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small werehouse 2'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small werehouse 3'] = {	--постройка
		['CP'] = 0.4,
	},
	['Small werehouse 4'] = {	--постройка
		['CP'] = 0.4,
	},
	['Subsidiary structure 1'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure 2'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure 3'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure A'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure B'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure C'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure D'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure E'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure F'] = {	--объект
		['CP'] = 0.4,
	},
	['Subsidiary structure G'] = {	--объект
		['CP'] = 0.4,
	},
	['Supermarket A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Tech hangar A'] = {	--постройка
		['CP'] = 0.4,
	},
	['Technician'] = {	--постройка
		['CP'] = 0.4,
	},
	['TV tower'] = {	--постройка
		['CP'] = 0.4,
	},
	['Water tower A'] = {	--постройка
		['CP'] = 0.4,
	},
	['WC'] = {	--постройка
		['CP'] = 0.4,
	},
	['Wellcarnsc'] = {	--ЖД
		['CP'] = 0.4,
	},
	['White_Flag'] = {	--объект
		['CP'] = 0.4,
	},
	['White_Tyre'] = {	--объект
		['CP'] = 0.4,
	},
	['Windsock'] = {-- объект
		['CP'] = 0.4,
	},
	['Workshop A'] = {	--постройка
		['CP'] = 0.4,
	},
	
}
Units_Ships = {--33

	--корабли
	['052B'] = {	--корабль
		['CP'] = 45.2,
	},
	['052C'] = {	--корабль
		['CP'] = 51.3,
	},
	['054A'] = {	--корабль
		['CP'] = 48.6,
	},
	['ALBATROS'] = {	--корабль
		['CP'] = 21.6,
	},
	['Dry-cargo ship-1'] = {	--корабль
		['CP'] = 5.4,
	},
	['Dry-cargo ship-2'] = {	--корабль
		['CP'] = 5.4,
	},
	['ELNYA'] = {	--корабль
		['CP'] = 5.4,
	},
	['Higgins_boat'] = {	--корабль
		['CP'] = 8.1,
	},
	['KILO'] = {	--корабль
		['CP'] = 8.1,
	},
	['KUZNECOW'] = {	--корабль
		['CP'] = 97.2,
	},
	['LHA_Tarawa'] = {	--корабль
		['CP'] = 37.8
	},
	['LST_Mk2'] = {	--корабль
		['CP'] = 16.2,
	},
	['MOLNIYA'] = {	--корабль
		['CP'] = 32.4,
	},
	['MOSCOW'] = {	--корабль
		['CP'] = 54.0,
	},
	['NEUSTRASH'] = {	--корабль
		['CP'] = 43.2
	},
	['PERRY'] = {	--корабль
		['CP'] = 48.6,
	},
	['PIOTR'] = {	--корабль
		['CP'] = 59.4,
	},
	['REZKY'] = {	--корабль
		['CP'] = 27,
	},
	['SOM'] = {	--корабль ПЛ
		['CP'] = 8.1,
	},
	['speedboat'] = {	--корабль
		['CP'] = 6.48,
	},
	['Stennis'] = {	--корабль
		['CP'] = 102.6,
	},
	['TICONDEROG'] = {	--корабль
		['CP'] = 54.0,
	},
	['US Carrier Technician'] = {	--корабль
		['CP'] = 0.54,
	},
	['US Carrier Technician Static Brown'] = {	--корабль
		['CP'] = 0.54,
	},
	['US Carrier Technician Static Green'] = {	--корабль
		['CP'] = 0.54,
	},
	['US Carrier Technician Static Purple'] = {	--корабль
		['CP'] = 0.54,
	},
	['US Carrier Technician Static Red'] = {	--корабль
		['CP'] = 0.54,
	},
	['US Carrier Technician Static White'] = {	--корабль
		['CP'] = 0.54,
	},
	['US Carrier Technician Static Yellow'] = {	--корабль
		['CP'] = 0.54,
	},
	['USS_Arleigh_Burke_IIa'] = {	--корабль
		['CP'] = 48.6,
	},
	['USS_Samuel_Chase'] = {		--корабль
		['CP'] = 16.2,
	},
	['VINSON'] = {	--корабль
		['CP'] = 102.6,
	},
	['ZWEZDNY'] = {	--корабль
		['CP'] = 5.4,
	},

}

--balance
K_guided = 1.0--3 \\стоимость AIM-120C составляет 0.0211 стоимости F-18C, 
-- поэтому коэфф. будет правильным сделать как K_guided=0.0211хK_Aircraft_Modern,
-- т.к. все УСП соотнесены к стоимости к AIM-120C
K_UNguided = 1.0
K_Aircraft_Modern = 25.0--25
K_Aircraft_WWII = 50.0--25.0___ 50.0- после перебаланса 07.10.2019 с Чижом, хотя на "глаз"=10.0..надо пробовать
K_Helicopters = 25.0--25.0--15 было..но т.к.вертолеты и самолеты измерены по одной методике, то коэфф.равны
K_Ground_Armor = 15.0--3.1 относит. АСП (Т72Б<->AIM120C) и до 7.8(M1A2<->AIM120C)  ...7.0 а по расчетам - 1/24 *K_Aircraft_Modern
K_Ground_AirDefense = 20.0--20.0--12.0--х19.6, если сравнивать с F-18C по стоимости и СР
K_Ground_Artillery = 15.0--3.0 былоб 15.0 - после перебаланса 07.10.2019 с Чижом
K_Construction = 10.0
K_Ships=25.0-- как для ЛА
k_threat=0.01-- по идее он не что иное как [CP] игрока,
--т.к. угроза есть мат.ожидание числа поражающих выстрелов от юнита, "несущего" угрозу


--при использовании в системе GS, например для Тунгуски (и конечно для любого юнита
--из раздела Units_Ground_AirDefense), определяем уточненный СР: CP=18*K_Ground_AirDefense
use_self_cp = true --это для умножения угрзы на СР игрока:
--true - умножаем значение угрозы на СР,
--false - не умножаем
-- (т.е. смотрим, сколько штрафа нужно списать
--на пребывание игрока в зоне угроз, при этом еще [CP] x K_Aircraft_Modern и уже после этого учитывается)
max_threat=0.2-- значение максимума на графике угрозы (на виджете), относительно которого строится высота цветных линий
k_threat_min=0.0427--0.0427-- секундная угроза от ПЗРК Стингер на удалении 4000м, р=0.5, tприц=6сек
--с этого значения (не менее чем) угроза начинает считаться в штраф, иначе игнорируется и не суммируется
t_char = 10--"характерное" время, влияет на показатель EXP
--['ZSU-23-4 Shilka'=2779
--Ка50=2269
kV_view = 2-- чем выше, тем больше  интенсивность роста индикатора угрозы ПОСЛЕ пуска ракеты противника 
